{"Auto-Generated/AI-Chats/AI-Chats":{"title":"AI Chats","links":["tags/"],"tags":["index"],"content":"index\nid: c31f9cc3-1c09-451a-8008-61bcf75e3310\nfolderPath: &quot;&quot;\ntitle: &quot;{{folderName}} overview&quot;\nshowTitle: false\ndepth: 10\nincludeTypes:\n  - folder\n  - markdown\nstyle: list\ndisableFileTag: false\nsortBy: name\nsortByAsc: true\nshowEmptyFolders: true\nonlyIncludeSubfolders: false\nstoreFolderCondition: true\nshowFolderNotes: true\ndisableCollapseIcon: true"},"Auto-Generated/Attachments/Sudokus/Sudokus":{"title":"Sudokus","links":["tags/sudoku","tags/"],"tags":["sudoku","index"],"content":"sudokuindex\nid: 9af4a5b2-4579-4487-b216-2b5e2c3c65a4\nfolderPath: &quot;&quot;\ntitle: &quot;{{folderName}} overview&quot;\nshowTitle: false\ndepth: 10\nstyle: list\nincludeTypes:\n  - folder\n  - markdown\n  - image\ndisableFileTag: false\nsortBy: name\nsortByAsc: true\nshowEmptyFolders: true\nonlyIncludeSubfolders: false\nstoreFolderCondition: true\nshowFolderNotes: true\ndisableCollapseIcon: true"},"Daily-Notes/Daily-Notes":{"title":"Daily Notes","links":[],"tags":[],"content":"id: 9fdf2bd2-13ce-43e5-b201-17e9451c6c79\nfolderPath: &quot;&quot;\ntitle: &quot;{{folderName}} overview&quot;\nshowTitle: false\ndepth: 10\nstyle: list\nincludeTypes:\n  - folder\n  - markdown\ndisableFileTag: false\nsortBy: name\nsortByAsc: true\nshowEmptyFolders: true\nonlyIncludeSubfolders: false\nstoreFolderCondition: true\nshowFolderNotes: true\ndisableCollapseIcon: true"},"Organised/Chess/Chess-Games/Chess-Games":{"title":"Chess Games","links":["tags/","tags/chess","tags/todo"],"tags":["index","chess","todo"],"content":"indexchesstodo\nid: 5641db88-aeb7-4060-98f2-ba6c13511b92\nfolderPath: &quot;&quot;\ntitle: &quot;{{folderName}} overview&quot;\nshowTitle: false\ndepth: 10\nincludeTypes:\n  - folder\n  - markdown\nstyle: list\ndisableFileTag: false\nsortBy: name\nsortByAsc: true\nshowEmptyFolders: true\nonlyIncludeSubfolders: false\nstoreFolderCondition: true\nshowFolderNotes: true\ndisableCollapseIcon: true\nname Create note from template\ntype command\naction Templater: Create new note from template\ncolor default"},"Organised/Chess/Chess-Openings/Chess-Openings":{"title":"Chess Openings","links":["tags/","tags/chess","tags/todo"],"tags":["index","chess","todo"],"content":"indexchesstodo\nid: 5ce652e5-7b19-4bf9-8756-23cc82534791\nfolderPath: &quot;&quot;\ntitle: &quot;{{folderName}} overview&quot;\nshowTitle: false\ndepth: 10\nincludeTypes:\n  - folder\n  - markdown\nstyle: list\ndisableFileTag: false\nsortBy: name\nsortByAsc: true\nshowEmptyFolders: true\nonlyIncludeSubfolders: false\nstoreFolderCondition: true\nshowFolderNotes: true\ndisableCollapseIcon: true\nname Create note from template\ntype command\naction Templater: Create new note from template\ncolor default"},"Organised/Craft/Crochet/Crochet":{"title":"Crochet","links":["tags/","tags/craft","tags/crochet","tags/todo"],"tags":["index","craft","crochet","todo"],"content":"indexcraftcrochettodo"},"Organised/Craft/Scrapbooking/Scrapbooking":{"title":"Scrapbooking","links":["tags/","tags/craft","tags/scrapbooking","tags/todo"],"tags":["index","craft","scrapbooking","todo"],"content":"indexcraftscrapbookingtodo"},"Organised/Health/Calisthenics/Calisthenics":{"title":"Calisthenics","links":["tags/","tags/health","tags/calisthenics","tags/fitness","tags/todo"],"tags":["index","health","calisthenics","fitness","todo"],"content":"indexhealthcalisthenicsfitnesstodo\nLog? Routines? Research?\n\nAlberto Nuñez Upper Lower\n\nBoostcamp\nReddit\nStronger247\nBodybuilding Forum\nScribd\n\n\n"},"Organised/Health/Energy-Beverages":{"title":"Energy Beverages","links":["tags/rando","tags/health","tags/todo"],"tags":["rando","health","todo"],"content":"randohealthtodo\nwww.ncbi.nlm.nih.gov/pmc/articles/PMC2966367/\nwww.youtube.com/watch"},"Organised/Health/One-Rep-Max-Calculations":{"title":"One-Rep Max Calculations","links":["tags/health","tags/fitness","tags/1RM"],"tags":["health","fitness","1RM"],"content":"healthfitness1RM\nTo calculate the maximum weight I can lift (1RM), I use various formulas. The Brzycki, Epley, and Lander formulas yield pretty accurate results, while the Lombardi and O’Conner formulas tend to underestimate, and the Mayhew and Wathan formulas overestimate.\n\nFormulae\n\nBrzycki: weight × (36 / (37 - reps))\nEpley: weight × (1 + 0.0333 × reps)\nLander: (100 × weight) / (101.3 - 2.67123 × reps)\nLombardi: weight × reps ^ 0.1\nMayhew et al.: (100 × weight) / (52.2 + (41.9 × e-0.055 × reps))\nO’Conner et al.: weight × (1 + 0.025 × reps)\nWathan: (100 × weight) / (48.8 + (53.8 × e ^ -0.075 × reps))\n\nYou can read more about these formulas in this NIH article."},"Organised/Health/Oral-Care":{"title":"Oral Care","links":["tags/health","tags/oralcare","tags/todo"],"tags":["health","oralcare","todo"],"content":"healthoralcaretodo\nOral care forms a crucial part of my health routine. It involves flossing, brushing, tongue scraping, mouth rinsing, and teeth whitening.\n\nFlossing\nFlossing helps get between your teeth before brushing. It covers about 40% of your tooth surface, so not flossing is similar to not washing your legs in the shower. Regular flossing helps prevent plaque, tartar, inflammation, and eventual bone loss leading to missing teeth.\n\nlittlesmilesofdelaware.com/blog/how-flossing-helps.\ndentalhealthtoday.com/index.html.\nwww.cosmetic-dentistry.net/post/5-things-that-will-change-your-mind-about-flossing.\n\n\nBrushing\nBrushing not only cleans your teeth but also your gums. A significant part of brushing should be at the border between your teeth and gums. To reach the back of your teeth, move your jaw along with the area you’re trying to clean. Both electric and manual toothbrushes can be effective, but studies show that electric toothbrushes can be more efficient when used correctly.\n\nTongue Scraping\nTongue scraping helps freshen breath by removing sulphur compounds and bacteria from the back of your tongue. You can use a toothbrush for the same purpose, but a hard scraper tends to be more efficient at removing the “gunk.”\n\nMouth Rinse\nA non-alcohol mouth rinse with a pH greater than 5.5 helps remineralise your teeth. It reaches areas that are easy to miss. However, ensure the rinse is not too acidic (less than 5.5 pH), which can demineralise your teeth. Also, avoid alcohol-containing mouth rinses as they can dry out your mouth, increasing the risk of cavities.\n\nWhitening\nTeeth, by their nature, come in a variety of hues and shades, including yellow. The prevailing societal beauty standard, however, promotes the idea of perfectly white teeth. This standard, when met, can potentially have a positive impact on an individual’s mental health, as it could boost self-esteem and confidence.\nIn our daily diet, we consume numerous colourful and acidic foods and drinks that can lead to the staining of our teeth. This includes items such as coffee, tea, red wine, and certain fruits like berries. Despite their potential to stain, it’s important to note that these foods and drinks can be enjoyed without causing permanent damage to the colour of our teeth. A simple preventive measure is to rinse the mouth with water immediately after consumption. This strategy helps to remove the staining compounds before they have a chance to adhere to the tooth enamel.\nHowever, it’s important to remember that brushing your teeth should be avoided for at least half an hour after eating or drinking these substances. Contrary to what one might think, brushing within the first half-hour can actually exacerbate the staining. This is because the acidity from the food or drink can temporarily soften the tooth enamel, making it more susceptible to abrasion from brushing.\nTo combat existing stains, there are a number of methods one can use. One particularly effective method is the use of hydrogen peroxide, a common ingredient in many whitening products. Hydrogen peroxide oxidizes the stains, effectively breaking them down and revealing a whiter surface underneath.\nAnother method is mechanical stain removal, which can be performed by a dentist or dental hygienist. This process involves physically removing the stains using special dental tools. While this method can be quite effective, it’s important to note that it should be done under professional supervision to avoid damaging the tooth enamel.\nIn conclusion, maintaining a healthy and aesthetically pleasing smile involves understanding the nature of teeth, practicing good dietary habits, and using appropriate stain removal methods."},"Organised/Health/Planning-Exercise":{"title":"Planning Exercise","links":["tags/health","tags/fitness","tags/todo","Organised/Health/One-Rep-Max-Calculations"],"tags":["health","fitness","todo"],"content":"healthfitnesstodo\nBefore a workout, do a warm-up set with 40% of the maximum weight for 5 reps, 60% for 5 reps, and 80% for 3 reps."},"Organised/Health/Sleep/Sleep":{"title":"Sleep","links":["tags/","tags/sleep","tags/health","tags/todo"],"tags":["index","sleep","health","todo"],"content":"indexsleephealthtodo\nPolyphasic, monophasic, sleep stages, dreaming, REM, sleep pressure, circadian rhythm, health risks, sleep schedules, sleep log(s)."},"Organised/Languages/Languages":{"title":"Languages","links":["tags/language","tags/","tags/todo"],"tags":["language","index","todo"],"content":"languageindextodo\nJapanese, German, French, Spanish, Italian, British Sign Language?"},"Organised/Music/Music-Production/Music-Production":{"title":"Music Production","links":["tags/music","tags/production","tags/todo"],"tags":["music","production","todo"],"content":"musicproductiontodo"},"Organised/Music/Piano/Piano":{"title":"Piano","links":["tags/music","tags/piano","tags/todo"],"tags":["music","piano","todo"],"content":"musicpianotodo"},"Organised/Pedagogy/Pedagogy":{"title":"Pedagogy","links":["single-system","tags/pedagogy","tags/","tags/todo","Highlighting-and-Annotating","Flashcards-and-Spaced-Repetition","Sleep-and-Learning","Preparation-for-Learning","Characteristics-of-Sleep","Memory-Science","Eisenhower-Matrix","Physical-and-Cognitive-Connection","Prioritizing-Tasks","Nutrition-in-Cognitive-Function","Exercise-and-the-Brain","Impact-of-Sleep-on-Learning","Polyphasic-Sleep-Patterns","Circadian-Rhythms-in-Learning","Optimization-of-Learning-Through-Sleep","Enhancing-Cognitive-Performance","Figure-5:-Bloom's-Taxonomy"],"tags":["pedagogy","index","todo"],"content":"A new journaling system. Commonplacing. Traveller’s Notebook. How we learn. Develop and integrate a single system, adding to and refining it.\npedagogyindextodo\nPedagogy: The Art and Science of Learning\nIntroduction\nIn the realm of education, the distinction between studying and learning is paramount. As highlighted by Pepper (2010), the act of studying does not guarantee learning. Many students find themselves trapped in a cycle of extensive studying with minimal retention or understanding. This phenomenon raises a critical question: What does it mean to truly learn?\nLearning, unlike mere studying, is characterized by the acquisition of knowledge or skills through experience, study, or by being taught, which results in a lasting change in behaviour or understanding. It is an active, not passive, process that involves engagement and the application of various strategies to ensure that information is not only consumed but internalized.\nActive vs. Passive Study Techniques\nStudents often default to passive study tactics, such as highlighting text, which may not be as effective as more active techniques like flashcards. The key is not the quantity of time spent studying but the quality of that time. This is analogous to an athlete’s training regimen: the benefits derived from a 20-minute high-intensity interval training (HIIT) session far exceed those from a leisurely 20-minute walk. The same principle applies to studying—the outcome is contingent upon the nature of the effort, not the duration (Pepper, 2010).\nThe Role of Sleep in Learning\nThe interplay between sleep and learning is intricate and significant. Wang et al. (2020) suggest that improved sleep quality is positively correlated with better learning outcomes. This dissertation will delve into the essential strategies for effective learning, the characteristics of sleep, and how the science of memory can be leveraged to enhance knowledge acquisition.\nIn the following sections, we will explore the methodologies and practices that can transform the act of studying into true learning. We will examine the preparatory steps one should take before engaging in study, the characteristics of sleep that influence cognitive function, and the application of memory science in educational contexts.\n\nThis note will serve as a foundational piece in understanding the broader landscape of pedagogy and its practical implications for students and educators alike. As we progress, each section will be expanded upon with evidence-based practices and theoretical frameworks that underpin the art and science of learning.\nTime Management\nTime management is a critical skill that is often misunderstood and underutilized in both academic and professional settings. According to Macan et al. (1990), effective time management is essential for success, yet it is a concept that many struggle to grasp and implement.\nThe Misconception of “Good” vs. “Bad” Students\nThe education system often promotes the idea of the “good” student as one who practices consistent, incremental study habits, embodying the “little and often” approach. Conversely, the “bad” student stereotype is associated with cramming all study into one intense session before a deadline. While cramming is widely regarded as inefficient, the urgency it creates can be a powerful motivator and a tool for time management.\nParkinson’s Law and Study Techniques\nAt the core of the debate on study habits is Parkinson’s Law, which posits that work expands to fill the time available for its completion (Bryan and Locke, 1967). This principle underlies several time management techniques, including:\nThe Pomodoro Technique\nThe Pomodoro Technique, developed by Cirillo in 2006, is a popular method involving 25 minutes of focused work followed by a 5-minute break. This cycle is repeated with longer breaks after every four intervals. Its effectiveness is attributed to the alignment with the performance pattern observed by Bligh (2000 as cited in Wilson and Korn, 2007), where attention spans tend to wane during continuous work but are rejuvenated following a break. However, due to its arbitrary nature, many find the prescribed intervals interruptive just as they reach peak focus. This has led to adaptations of the technique, such as varying the work/break intervals to suit individual preferences (Scholz, 2021).\nFlow State and Micro-Goals\nAnother approach leverages the concept of the “flow state,” where one is fully immersed and focused on the task at hand. This technique involves setting micro-goals and timing the period to reach a 25-50 percent focus level, then taking a proportional break. While subjective, this method can improve with practice and self-awareness.\nDeliberate Breaks\nRegardless of the chosen technique, the importance of deliberate breaks is emphasized (Kühnel et al, 2017). Activities such as meditation, walking, or engaging in a different form of entertainment can significantly aid in recovery and subsequent performance (Monk-Turner, 2003).\nThe 15-Minute Rule and Prioritization\nEven with effective time management techniques, students may still face the challenge of spending excessive time on unsolvable problems. The 15-minute rule (Buchanan, 2012) suggests spending a quarter of an hour attempting to solve a problem before seeking help, which can make any external assistance more effective.\nThe larger issue at hand is often poor prioritization, where trivial tasks consume valuable time. The Pareto Principle, or the 80/20 Rule, posits that 80% of outcomes are due to 20% of causes (Dunford et al, 2014). This principle underscores the importance of focusing on tasks that yield the most significant results.\nEisenhower’s Matrix\nA practical tool for prioritizing tasks is Eisenhower’s Matrix, which categorizes tasks based on urgency and importance into four quadrants. This system guides individuals to tackle urgent and important tasks first, plan for those that are important but not urgent, delegate the urgent but unimportant, and eliminate tasks that are neither urgent nor important.\nPhysical Well-being and Cognitive Performance\nFinally, it is crucial to recognize the link between physical well-being and cognitive performance. The way we spend our time should not only be efficient but also balanced, ensuring that physical health is maintained to support mental acuity.\n\nIn the subsequent sections, we will explore the relationship between physical health and cognitive function, and how to effectively allocate our most precious resource—time—to maximize learning and productivity. This will include a deeper look into the Eisenhower’s Matrix for prioritization, the connection between physical well-being and cognitive performance, and strategies for prioritizing tasks effectively.\nPhysical Aspects of Learning\nThe physical aspects of learning encompass more than just the mental effort put into studying; they involve a holistic approach that includes reading, consistent practice, and the maintenance of physical health.\nThe Five-Hour Rule\nThe concept of the five-hour rule, popularized by Michael Simmons and attributed to the practices of Benjamin Franklin, emphasizes the importance of dedicating at least one hour per day to reading and learning. This practice is not only historical but is also supported by modern research, with Kane (2014) noting that a significant majority of self-made millionaires engage in daily reading and learning activities. The consistency of this habit is crucial, as it allows for substantial knowledge acquisition over time.\nConsistency and Its Challenges\nThe year 2020, marked by the COVID-19 pandemic, underscored the importance of consistency in education. The disruption caused by the pandemic led to a decline in the effectiveness of learning due to the suspension of educational facilities (Chaturvedi et al, 2021). The lack of consistent educational engagement has been linked to educational losses on multiple levels.\nThe Impact of Physical Health on Learning\nThe pandemic also highlighted the interconnection between physical health and learning. Increased screen time has been associated with poor sleep, reduced physical activity, and subsequent mental health issues (Oswald et al, 2020). These issues can manifest in physical health problems, including poor dietary choices. Therefore, it is evident that learning is not only affected by the consistency of study habits but also by the physical well-being of the student.\nNutrition, Exercise, and Sleep\nNutrition and exercise are two critical components that influence the third factor: sleep. Proper nutrition is well-understood in its importance, but the role of exercise is multifaceted. Exercise directly benefits cognitive function by reducing insulin resistance and inflammation and stimulating the release of growth factors. Indirectly, it improves mood, sleep, and reduces stress and anxiety, all of which contribute to a healthier brain environment, particularly in the hippocampus, which is associated with verbal memory and learning (Nystoriak and Bhatnagar, 2018).\nThe Role of Sleep in Learning\nSleep is a fundamental requirement for all higher life forms and is crucial for learning. Sleep deprivation can have severe physiological consequences, affecting a student’s ability to learn effectively. The quality of sleep is intimately linked to the quality of learning, raising the question of how to optimize sleep to enhance educational outcomes.\n\nIn the following sections, we will delve into the specifics of how sleep quality can be optimized, the role of nutrition and exercise in cognitive performance, and the strategies for maintaining consistency in learning practices. We will also explore the broader implications of physical well-being on learning, including the impact of sleep on learning and how to mitigate the adverse effects of factors such as increased screen time.\nExplaining the Nature of Sleep\nSleep is a complex and essential biological process, categorized into two primary types: non-rapid eye movement (NREM) and rapid eye movement (REM) sleep (Colten et al, 2006). Understanding these stages is crucial for optimizing learning and overall well-being.\nNREM and REM Sleep\nNREM sleep consists of four stages, ranging from light to deep sleep. The sleep cycle begins with stage 1 of NREM, progressing through to the deeper stages and culminating in REM sleep. This cycle repeats several times throughout a typical night’s sleep, with REM periods becoming longer as the night progresses.\nNREM Stages\n\nStage 1: This initial stage is a transition period between wakefulness and sleep that lasts for a few minutes, making up a small percentage of the sleep cycle.\nStage 2: Occupying the largest portion of the sleep cycle, stage 2 is crucial for memory consolidation. The presence of sleep spindles, as observed in EEG patterns, is associated with the integration of new information, supporting the concept of “sleeping on a problem” (Stickgold, 2005).\nStages 3 and 4 (Slow-Wave Sleep): These stages are characterized by deep sleep, with stage 4 being the deepest, where the arousal threshold is highest.\n\nREM Sleep\nREM sleep is marked by active brain patterns, muscle atonia, and rapid eye movements. It is often associated with vivid dreaming and is also thought to play a role in memory consolidation.\nSleep Cycles and Efficiency\nThe typical monophasic sleep pattern consists of multiple 90-minute cycles. However, polyphasic sleep patterns, which involve multiple sleep phases throughout the day, have been suggested as a more efficient alternative, potentially reducing the overall need for sleep and mitigating issues like jet lag (Colten et al, 2006).\nSleep Stage Repartitioning\nThe body prioritizes REM and slow-wave sleep (SWS), with REM pressure building quickly and SWS pressure building slowly. This repartitioning ensures that the most critical stages of sleep are preserved, especially when sleep is restricted (Nade, 2022).\nCircadian Rhythms\nCircadian rhythms regulate various physiological and behavioral processes, including the sleep-wake cycle. They are influenced by two processes: the homeostatic drive for sleep (process S) and the circadian alerting system (process C). Manipulating these processes, such as by adjusting body temperature or timing of physical activity and meals, can influence sleep patterns and efficiency (Fuller et al, 2006; Crispim et al, 2007).\nThe Role of Light Sleep\nWhile deep sleep stages are crucial, light sleep stages (NREM1 and NREM2) also serve important functions, particularly in recovery from mental and physical exertion. Short naps consisting of light sleep can improve wakefulness and performance without the grogginess often associated with longer naps (Lam et al, 2011).\n\nIn summary, sleep is a multifaceted process that plays a vital role in learning and cognitive function. By understanding and optimizing the various stages of sleep, particularly through strategies like sleep stage repartitioning and aligning with circadian rhythms, one can enhance the quality of both sleep and learning. The next sections will explore how to apply this knowledge to develop effective sleep habits, including the potential benefits of polyphasic sleep and the importance of circadian rhythms in cognitive performance.\nPersonal Case Study: Self-Experimentation with Polyphasic Sleep\nTransition from Monophasic to Polyphasic Sleep\nThe shift from a monophasic sleep schedule, which is the most common pattern of sleep involving around 9 hours of continuous night-time rest, to a polyphasic sleep pattern represents a significant change in lifestyle and requires careful consideration and adaptation.\nInitial Challenges and Adaptations\nThe initial adoption of the Everyman sleep pattern, which drastically reduces night-time sleep in favor of multiple short naps, presented immediate challenges. The experience of intense sleep deprivation highlighted the body’s need for a period of adjustment and the importance of a gradual transition to alternative sleep schedules.\nSegmented Dual-Core Sleep\nSwitching to a segmented dual-core sleep pattern, which aligns more closely with historical sleep patterns, provided a more sustainable approach. This pattern, consisting of two 3-hour sleep blocks with a period of wakefulness in between, allowed for better sleep quality and the integration of a productive flow state during the early morning hours.\nCircadian Rhythm Regulation\nTo further support this new sleep schedule, strategies such as extended periods of darkness and intermittent fasting were employed to regulate the circadian rhythm. These practices not only facilitated the adjustment to the new sleep pattern but also contributed to overall well-being and cognitive function.\nImplications for Learning\nThe experience of modifying sleep patterns has implications for learning efficiency. By optimizing sleep and aligning it with the body’s natural rhythms, one can potentially enhance cognitive performance and make future learning endeavors more effective.\n\nThis personal case study underscores the potential benefits and challenges of self-experimentation with sleep patterns. It also highlights the importance of understanding one’s own body and the need for careful monitoring when making significant changes to sleep habits. The insights gained from this experiment can inform further exploration into the optimization of learning through sleep and the development of personalized strategies for enhancing cognitive performance.\nEncoding Strategies in Learning\nUnderstanding Bloom’s Taxonomy\nBloom’s Taxonomy, as illustrated in Figure 5, provides a hierarchical classification of learning objectives that educators can use to focus on higher-order thinking skills. The taxonomy emphasizes the importance of progressing beyond mere recall of facts (Forehand, 2010) to deeper levels of understanding, application, analysis, evaluation, and creation (Michael, 2006).\nThe Challenge and Reward of Higher-Order Thinking\nEngaging with the higher levels of Bloom’s Taxonomy presents an initial challenge but can lead to more significant learning outcomes. For instance, a student conducting a chemistry experiment without prior knowledge may struggle initially but will learn more deeply through the process of investigation and application.\nCognitive Load and Stress in Learning\nThe concept of cognitive load is crucial when imposing challenges on learners. The Yerkes-Dodson law suggests that while a certain amount of stress can enhance performance, too much stress can be detrimental (Broadhurst, 1959). This balance is essential when designing learning experiences that push students to higher levels of Bloom’s Taxonomy without overwhelming them.\nThe Role of Memory Functions\nHuman memory functions—encoding, storage, and retrieval—are fundamental to learning (McLeod, 2007). Encoding, or the process of transferring information into the memory system, is particularly important as it involves categorizing and connecting new information with existing knowledge, often during sleep (Stickgold, 2005).\nAutomatic vs. Effortful Processing\nEncoding can be automatic, as with the subconscious recall of time or space, or effortful, as with learning new skills like driving or algebra (Hartlage et al., 1993). Mastery of “threshold topics” requires effortful processing before they can be encoded automatically (Meyer et al., 2010).\nMethods of Encoding\nThere are three primary methods of encoding information: semantic, visual, and acoustic. Semantic encoding, which involves connecting new information to existing knowledge, has been shown to be particularly effective (Bousfield, 1935; Rice University, 2017). Visual encoding relates to imagery, and acoustic encoding is often used in learning through music or rhymes (Tierney et al., 2013).\nThe Effectiveness of Semantic Encoding\nResearch by Craik and Tulving (1975) indicates that semantic encoding is more effective than visual or acoustic encoding, likely due to the deeper level of processing involved.\nRecoding and Mnemonics\nRecoding involves converting information into a format that is easier to understand, such as through the use of mnemonics. However, this can sometimes lead to the memorization of extraneous information (Henson, 2000).\nStrategies to Enhance Retention\nPsychologists have explored various strategies to enhance retention during study, such as elaborative encoding, which involves actively connecting new themes to prior knowledge (Craik &amp; Lockhart, 1972), and creating vivid mental images (Bower &amp; Reitman, 1972).\nThe Role of Priming in Learning\nPriming is a technique where exposure to one stimulus influences the response to a subsequent stimulus, which can be used to enhance learning about a subject (Schater and Buckner, 1998). This is particularly useful when approaching threshold concepts, which, once understood, can transform a student’s perspective on a subject (Meyer et al., 2010).\n\nIn summary, the process of encoding in learning is multifaceted, involving various strategies that can enhance the retention and application of knowledge. By understanding and applying these strategies, students can navigate through the levels of Bloom’s Taxonomy more effectively, leading to deeper and more enduring learning experiences. The integration of these concepts is essential for educators and learners alike, as they strive to create learning environments that foster higher-order thinking and meaningful engagement with the material.\nConsolidation Strategies in Learning\nPurpose of Note-Taking\nNote-taking should be intentional and tailored to its purpose—whether for recording information, revision, or demonstrating engagement. Mindless copying is ineffective; notes should be crafted for their intended use.\nThe Cornell Note-Taking System\nThe Cornell System, as described by Quintus et al. (2012), is a structured method that divides a page into three sections for notes, cues, and summary. This system encourages concise note-taking and active engagement with the material through delayed note-taking, which aligns with the concept of recoding.\nMind Maps for Nonlinear Learning\nMind maps address the limitations of linear note-taking systems like Cornell by visually and immediately connecting concepts. The GRINDE acronym (Sung, 2020) encapsulates the principles of effective mind mapping, ensuring that ideas are grouped, reflective, interconnected, non-verbal, directional, and emphasized.\nOvercoming the Forgetting Curve\nThe forgetting curve illustrates the decline of memory retention over time. Regular review of material, utilizing spaced repetition, can combat this natural forgetfulness (Averell and Heathcote, 2011). The effortful retrieval involved in spaced repetition strengthens encoding.\nIdentifying Problem Areas\nThe “Paper Test” is a diagnostic tool to identify gaps in knowledge. By creating a mind map from memory, learners can pinpoint missing information and focus on threshold topics that require additional attention.\nFlashcards for Reinforcement\nFlashcards facilitate active recall and self-testing, which are crucial for memory consolidation (Kornell, 2009). The process of creating flashcards is itself a form of encoding, and using them in a spaced repetition system like the Leitner System (Byrson, 2012) can help prioritize areas that need more focus.\nThe Feynman Technique for Deep Understanding\nThe Feynman Technique, named after physicist Richard Feynman, emphasizes the importance of simplifying complex information to teach it to others. This method ensures a deep understanding of the subject matter and clarifies thought processes (Reyes et al., 2013).\n\nIn essence, consolidation in learning is about making the information stick. It’s not just about taking notes or memorizing facts; it’s about integrating and synthesizing information in a way that makes it part of your cognitive framework. By using structured note-taking systems, visual aids like mind maps, and active recall techniques, students can enhance their learning and retention. The Feynman Technique further refines this process by ensuring that understanding is deep enough to teach others in simple terms. These strategies are not just about passing exams; they’re about truly understanding and being able to apply knowledge in various contexts.\nConclusion\nIn conclusion, the interplay between physical well-being and learning efficiency cannot be overstated. Regular physical activity and a balanced diet are foundational to maintaining the cognitive functions necessary for effective learning. Time management strategies such as the Eisenhower Matrix, Pareto Principle, or Pomodoro Technique can optimize the learning process by focusing on what’s essential and managing distractions.\nUnderstanding the mechanics of memory, particularly encoding and recoding, is critical for students to effectively internalize and retain complex material. The choice of note-taking techniques, whether it be the structured Cornell method or the more visual and interconnected GRINDE approach for mind maps, should align with the individual’s learning style and the nature of the material being studied.\nSleep plays a dual role in this complex system, serving both as a critical component for memory consolidation and as a fundamental pillar of overall health. Whether one follows a monophasic or polyphasic sleep pattern, the key is consistency and alignment with one’s daily routine to ensure restorative sleep.\nUltimately, the most effective learning strategy is one that a student can consistently apply and adapt to their individual needs and circumstances. It should encompass not only the aforementioned physical and cognitive strategies but also incorporate effective priming, encoding, recoding, note-taking, and consolidation techniques.\nFurther research into the long-term effects of polyphasic sleep, especially more extreme variations, could provide valuable insights into optimizing the balance between learning, sleep, and overall well-being. Additionally, promoting awareness and understanding of concepts like priming and encoding could significantly enhance educational practices and outcomes.\nThe journey of learning is deeply personal and multifaceted, and while efficiency is desirable, it should not come at the cost of health or personal well-being. Each student must find a harmonious balance that supports both their educational ambitions and their life outside of academics.\n\nReferences\nCrimson &amp; GeneralNguyen: Polyphasic Sleep Community (2021) ‘Sleep Repartitioning’, POLYPHASIC SLEEP | Sleep Right, Live Well [Online]. Available at www.polyphasic.net/repartition/ (Accessed 23 March 2022).\nAverell, L. and Heathcote, A. (2011) ‘The form of the forgetting curve and the fate of memories’, Journal of Mathematical Psychology, Special Issue on Hierarchical Bayesian Models, vol. 55, no. 1, pp. 25–35 [Online]. DOI: 10.1016/j.jmp.2010.08.009.\nBower, G. H. and Reitman, J. S. (1972) ‘Mnemonic elaboration in multilist learning’, Journal of Verbal Learning and Verbal Behavior, vol. 11, no. 4, pp. 478–485 [Online]. DOI: 10.1016/S0022-5371(72)80030-6.\nBratterud, H., Burgess, M., Fasy, B. T., Millman, D. L., Oster, T. and Sung, E. (Christine) (2020) ‘The Sung Diagram: Revitalizing the Eisenhower Matrix’, Pietarinen, A.-V., Chapman, P., Bosveld-de Smet, L., Giardino, V., Corter, J., and Linker, S. (eds), Diagrammatic Representation and Inference, Lecture Notes in Computer Science, Cham, Springer International Publishing, pp. 498–502 [Online]. DOI: 10.1007/978-3-030-54249-8_43.\nBroadhurst, P. L. (1959) ‘The interaction of task difficulty and motivation: The Yerkes Dodson law revived’, Acta Psychologica, Amsterdam, vol. 16, pp. 321–338 [Online]. DOI: 10.1016/0001-6918(59)90105-2.\nBryan, J. F. and Locke, E. A. (1967) ‘Parkinson’s Law as a goal-setting phenomenon’, Organizational Behavior and Human Performance, vol. 2, no. 3, pp. 258–275 [Online]. DOI: 10.1016/0030-5073(67)90021-9.\nBryson, D. (2012) ‘Using Flashcards to Support Your Learning’, Journal of Visual Communication in Medicine, Taylor &amp; Francis, vol. 35, no. 1, pp. 25–29 [Online]. DOI: 10.3109/17453054.2012.655720.\nBuchanan, C. (2012) The 15 Minute Rule: How to stop procrastinating and take charge of your life, Hachette UK.\nChaput, J.-P., Dutil, C., Featherstone, R., Ross, R., Giangregorio, L., Saunders, T. J., Janssen, I., Poitras, V. J., Kho, M. E., Ross-White, A., Zankar, S. and Carrier, J. (2020) ‘Sleep timing, sleep consistency, and health in adults: a systematic review’, Applied Physiology, Nutrition, and Metabolism, NRC Research Press, vol. 45, no. 10 (Suppl. 2), pp. S232–S247 [Online]. DOI: 10.1139/apnm-2020-0032.\nChaturvedi, K., Vishwakarma, D. K. and Singh, N. (2021) ‘COVID-19 and its impact on education, social life and mental health of students: A survey’, Children and Youth Services Review, vol. 121, p. 105866 [Online]. DOI: 10.1016/j.childyouth.2020.105866.\nChau, F.-W. (2017) How to read more by using Pomodoro Technique [Online]. Available at chaurocks.com/read-more-using-pomodoro-technique/ (Accessed 23 March 2022).\nCirillo, F. (2007) ‘The Pomodoro Technique (The Pomodoro)’, p. 45.\nColten, H. R., Altevogt, B. M. and Research, I. of M. (US) C. on S. M. and (2006) Sleep Physiology, Sleep Disorders and Sleep Deprivation: An Unmet Public Health Problem, National Academies Press (US) [Online]. Available at www.ncbi.nlm.nih.gov/books/NBK19956/ (Accessed 23 March 2022).\nCraik, F. I. M. and Lockhart, R. S. (1972) ‘Levels of processing: A framework for memory research’, Journal of Verbal Learning and Verbal Behavior, vol. 11, no. 6, pp. 671–684 [Online]. DOI: 10.1016/S0022-5371(72)80001-X.\nCraik, F. I. M. and Tulving, E. (1975) ‘Depth of processing and the retention of words in episodic memory’, Journal of Experimental Psychology: General, US, American Psychological Association, vol. 104, no. 3, pp. 268–294 [Online]. DOI: 10.1037/0096-3445.104.3.268.\nCrispim, C. A., Zalcman, I., Dáttilo, M., Padilha, H. G., Edwards, B., Waterhouse, J., Tufik, S. and Mello, M. T. de (2007) ‘The influence of sleep and sleep loss upon food intake and metabolism’, Nutrition Research Reviews, Cambridge University Press, vol. 20, no. 2, pp. 195–212 [Online]. DOI: 10.1017/S0954422407810651.\nDunford, R., Su, Q. and Tamang, E. (2014) ‘The Pareto Principle’, University of Plymouth [Online]. Available at pearl.plymouth.ac.uk/handle/10026.1/14054 (Accessed 23 March 2022).\nEkirch, A. R. (2016) ‘Segmented Sleep in Preindustrial Societies’, Sleep, vol. 39, no. 3, pp. 715–716 [Online]. DOI: 10.5665/sleep.5558.\nFarnam Street (2018) The Spacing Effect: How to Improve Learning and Maximize Retention [Online]. Available at fs.blog/spacing-effect/ (Accessed 23 March 2022).\nForehand, M. (2011) ‘Bloom’s Taxonomy’, The University of Georgia.\nFuller, P. M., Gooley, J. J. and Saper, C. B. (2006) ‘Neurobiology of the Sleep-Wake Cycle: Sleep Architecture, Circadian Regulation, and Regulatory Feedback’, Journal of Biological Rhythms, SAGE Publications Inc, vol. 21, no. 6, pp. 482–493 [Online]. DOI: 10.1177/0748730406294627.\nHartlage, S., Alloy, L. B., Vázquez, C. and Dykman, B. (1993) ‘Automatic and effortful processing in depression’, Psychological Bulletin, US, American Psychological Association, vol. 113, no. 2, pp. 247–278 [Online]. DOI: 10.1037/0033-2909.113.2.247.\nHenson, R. N. A., Burgess, N. and Frith, C. D. (2000) ‘Recoding, storage, rehearsal and grouping in verbal short-term memory: an fMRI study’, Neuropsychologia, vol. 38, no. 4, pp. 426–440 [Online]. DOI: 10.1016/S0028-3932(99)00098-6.\nhow I studied for 12 hours a day for over a year (2021) Directed by James Scholz [Film].\nThe Perfect Mindmap: 6 Step Checklist (2020) Directed by Justin Sung [Film].\nKane, L. (2014) 9 things rich people do and don’t do every day [Online]. Available at www.businessinsider.com/rich-people-daily-habits-2014-6 (Accessed 23 March 2022).\nKornell, N. (2009) ‘Optimising learning using flashcards: Spacing is more effective than cramming’, Applied Cognitive Psychology, vol. 23, no. 9, pp. 1297–1317 [Online]. DOI: 10.1002/acp.1537.\nKos, B. (2021) The Eisenhower matrix – A popular prioritization framework | Spica [Online]. Available at www.spica.com/blog/the-eisenhower-matrix (Accessed 23 March 2022).\nKühnel, J., Zacher, H., de Bloom, J. and Bledow, R. (2017) ‘Take a break! Benefits of sleep and short breaks for daily work engagement’, European Journal of Work and Organizational Psychology, Routledge, vol. 26, no. 4, pp. 481–491 [Online]. DOI: 10.1080/1359432X.2016.1269750.\nLam, J. C., Mahone, E. M., Mason, T. B. A. and Scharf, S. M. (2011) ‘The Effects of Napping on Cognitive Function in Preschoolers’, Journal of developmental and behavioral pediatrics : JDBP, vol. 32, no. 2, pp. 90–97 [Online]. DOI: 10.1097/DBP.0b013e318207ecc7.\nMacan, T. H., Shahani, C., Dipboye, R. L. and Phillips, A. P. (1990) ‘College students’ time management: Correlations with academic performance and stress’, Journal of Educational Psychology, US, American Psychological Association, vol. 82, no. 4, pp. 760–768 [Online]. DOI: 10.1037/0022-0663.82.4.760.\nMaquet, P. (2001) ‘The Role of Sleep in Learning and Memory’, Science, American Association for the Advancement of Science, vol. 294, no. 5544, pp. 1048–1052 [Online]. DOI: 10.1126/science.1062856.\nMcLeod, S. A. (2007) ‘[Stages of memory-encoding storage and retrieval]’, [Online]. Available at www.simplypsychology.org/memory.html (Accessed 23 March 2022).\nMeyer, J. H. F., Land, R. and Baillie, C. (2010) Threshold Concepts and Transformational Learning, BRILL [Online]. DOI: 10.1163/9789460912078 (Accessed 23 March 2022).\nMichael, J. (2006) ‘Where’s the evidence that active learning works?’, Advances in Physiology Education, American Physiological Society, vol. 30, no. 4, pp. 159–167 [Online]. DOI: 10.1152/advan.00053.2006.\nMonk-Turner, E. (2003) ‘The benefits of meditation: experimental findings’, The Social Science Journal, vol. 40, no. 3, pp. 465–470 [Online]. DOI: 10.1016/S0362-3319(03)00043-0.\nNade (2022) Sleep Stage Repartitioning [Online]. Available at www.mattressnerd.com/polyphasic-sleep/science/repartitioning/ (Accessed 23 March 2022).\nNystoriak, M. A. and Bhatnagar, A. (2018) ‘Cardiovascular Effects and Benefits of Exercise’, Frontiers in Cardiovascular Medicine, vol. 5 [Online]. Available at www.frontiersin.org/article/10.3389/fcvm.2018.00135 (Accessed 23 March 2022).\nOkanovic, D. (2021) The quick guide to Bloom’s taxonomy for teachers [Online]. Available at www.bibguru.com/blog/blooms-taxonomy/ (Accessed 23 March 2022).\nOswald, T. K., Rumbold, A. R., Kedzior, S. G. E. and Moore, V. M. (2020) ‘Psychological impacts of “screen time” and “green time” for children and adolescents: A systematic scoping review’, PLOS ONE, Public Library of Science, vol. 15, no. 9, p. e0237725 [Online]. DOI: 10.1371/journal.pone.0237725.\nPepper, C. (2010) ‘“There’s a lot of learning going on but NOT much teaching!”: student perceptions of Problem‐Based Learning in science’, Higher Education Research &amp; Development, vol. 29, no. 6, pp. 693–707 [Online]. DOI: 10.1080/07294360.2010.501073.\nQuintus, L., Borr, M., Duffield, S., Napoleon, L. and Welch, A. (2012) ‘The Impact of the Cornell Note-Taking Method on Students’ Performance in a High School Family and Consumer Sciences Class’, p. 13.\nRead-Bivens (2016) ‘Abandoning Pomodoros, Part One: The Pros and Cons of Pomos’, Medium [Online]. Available at medium.com/@UrgentPigeon/abandoning-pomodoros-part-one-the-pros-and-cons-of-pomos-e3f3e9342ac9 (Accessed 23 March 2022).\nReyes, E. P., Blanco, R. M. F. L., Doroon, D. R. L., Limana, J. L. B. and Torcende, A. M. A. (2021) ‘Feynman Technique as a Heutagogical Learning Strategy for Independent and Remote Learning’, Recoletos Multidisciplinary Research Journal, vol. 9, no. 2, pp. 1–13 [Online]. DOI: 10.32871/rmrj2109.02.06.\nSchacter, D. L. and Buckner, R. L. (1998) ‘Priming and the Brain’, Neuron, vol. 20, no. 2, pp. 185–195 [Online]. DOI: 10.1016/S0896-6273(00)80448-1.\nScharf, M. (2017) ‘My New Goal: Follow Ben Franklin’s Rule to Set Aside 1 Hour a Day to Learn’, UCF Forum [Online]. Available at stars.library.ucf.edu/ucf-forum/238.\nSimmons, M. (2018) Why Constant Learners All Embrace the 5-Hour Rule - Michael D. Simmons [Online]. Available at michaeldsimmons.com/why-constant-learners-all-embrace-the-5-hour-rule-mm09/ (Accessed 23 March 2022).\nSteriade, M. (2004) ‘Acetylcholine systems and rhythmic activities during the waking–sleep cycle’, in Progress in Brain Research, Acetylcholine in the Cerebral Cortex, Elsevier, vol. 145, pp. 179–196 [Online]. DOI: 10.1016/S0079-6123(03)45013-9 (Accessed 23 March 2022).\nStickgold, R. (2005) ‘Sleep-dependent memory consolidation’, Nature, vol. 437, no. 7063, pp. 1272–1278 [Online]. DOI: 10.1038/nature04286.\nSweller, J. (1994) ‘Cognitive load theory, learning difficulty, and instructional design’, Learning and Instruction, vol. 4, no. 4, pp. 295–312 [Online]. DOI: 10.1016/0959-4752(94)90003-5.\nTierney, A., Krizman, J., Skoe, E., Johnston, K. and Kraus, N. (2013) ‘High school music classes enhance the neural processing of speech’, Frontiers in Psychology, vol. 4 [Online]. Available at www.frontiersin.org/article/10.3389/fpsyg.2013.00855 (Accessed 23 March 2022).\nUniversity, R. (2017) ‘Memory’, [Online]. Available at lidtfoundations.pressbooks.com/chapter/memory/ (Accessed 23 March 2022).\nVotruba, T. (2012) ‘Psychological outcomes of polyphasic sleep’, Masarykova univerzita, Fakulta sociálních studií [Online]. Available at is.muni.cz/th/363896/fss_b/tomas-votruba-psychological-impacts-of-polyphasic-sleep.pdf (Accessed 23 March 2022).\nWang, Y., Xiao, H., Zhang, X. and Wang, L. (2020) ‘The Role of Active Coping in the Relationship Between Learning Burnout and Sleep Quality Among College Students in China’, Frontiers in Psychology, vol. 11 [Online]. Available at www.frontiersin.org/article/10.3389/fpsyg.2020.00647 (Accessed 23 March 2022).\nWeiland, A. and Kingsbury, S. J. (1979) ‘Immediate and Delayed Recall of Lecture Material as a Function of Note Taking’, The Journal of Educational Research, Routledge, vol. 72, no. 4, pp. 228–230 [Online]. DOI: 10.1080/00220671.1979.10885160.\nWilson, K. and Korn, J. H. (2007) ‘Attention during Lectures: Beyond Ten Minutes’, Teaching of Psychology, SAGE Publications Inc, vol. 34, no. 2, pp. 85–89 [Online]. DOI: 10.1080/00986280701291291.\nZhu, Q. and Xiang, H. (2016) ‘Differences of Pareto principle performance in e-resource download distribution: An empirical study’, The Electronic Library, Emerald Group Publishing Limited, vol. 34, no. 5, pp. 846–855 [Online]. DOI: 10.1108/EL-05-2015-0068."},"Organised/Photography/Photography":{"title":"Photography","links":["tags/photography","tags/","tags/todo"],"tags":["photography","index","todo"],"content":"photographyindextodo\nFilm photography, exposure, framing, my photos, etc.?"},"Organised/Programming/Programming":{"title":"Programming","links":["tags/programming","tags/","tags/todo"],"tags":["programming","index","todo"],"content":"programmingindextodo\nPortfolio?"},"Organised/Programming/Python/NumPy-Docstrings":{"title":"NumPy Docstrings","links":["tags/programming","tags/python","tags/docstrings","tags/todo","tags/blankslate"],"tags":["programming","python","docstrings","todo","blankslate"],"content":"programmingpythondocstringstodoblankslate"},"Organised/Programming/Python/Program-Structure":{"title":"Program Structure","links":["tags/programming","tags/python","tags/todo","tags/blankslate"],"tags":["programming","python","todo","blankslate"],"content":"programmingpythontodoblankslate"},"Organised/Programming/Python/Python":{"title":"Python","links":["tags/programming","tags/","tags/python","tags/todo"],"tags":["programming","index","python","todo"],"content":"programmingindexpythontodo\nid: 6ecf9856-7bb0-4757-b363-1875f9396880\nfolderPath: &quot;&quot;\ntitle: &quot;{{folderName}} overview&quot;\nshowTitle: false\ndepth: 10\nincludeTypes:\n  - folder\n  - markdown\nstyle: list\ndisableFileTag: false\nsortBy: name\nsortByAsc: true\nshowEmptyFolders: true\nonlyIncludeSubfolders: false\nstoreFolderCondition: true\nshowFolderNotes: true\ndisableCollapseIcon: true"},"Organised/Recipes/Recipes":{"title":"Recipes","links":["tags/cooking","tags/","tags/todo"],"tags":["cooking","index","todo"],"content":"cookingindextodo\nid: b728a0c8-aac4-4dab-9535-91c8b9e5690c\nfolderPath: &quot;&quot;\ntitle: &quot;{{folderName}} overview&quot;\nshowTitle: false\ndepth: 10\nincludeTypes:\n  - folder\n  - markdown\nstyle: list\ndisableFileTag: false\nsortBy: name\nsortByAsc: true\nshowEmptyFolders: true\nonlyIncludeSubfolders: false\nstoreFolderCondition: true\nshowFolderNotes: true\ndisableCollapseIcon: true\nname Create note from template\ntype command\naction Templater: Create new note from template\ncolor default"},"Unorganised/Grinding":{"title":"Grinding","links":["tags/questlog","Unorganised/Main-Quests","Unorganised/Side-Quests"],"tags":["questlog"],"content":"questlog\nStuff that I need to do, but don’t really want to :)\nRelated: Main Quests and Side Quests.\n\nChores\n\n Vacuum.\n Washing.\n"},"Unorganised/Main-Quests":{"title":"Main Quests","links":["tags/questlog","Unorganised/Side-Quests","Unorganised/Grinding"],"tags":["questlog"],"content":"questlog\nStuff I want do and need to do :)\nRelated: Side Quests and Grinding.\n\nPersonal\n\n Set up Quartz to work with the new ‘default’ vault in a visually appealing way, matching my current aesthetic. Make it auto build?\n Finish my Obsidian setup.\n Finish all of my programming projects.\n Update Blankslate, borrowing features from ANPPT (such as storing version data in __init__.py files, checkboxes for README.md features, as well as fixing how my logger works so that I don’t create a new logger for every module, instead using inherited logging etc.). Also implement the ability to formalise a project from just a source folder. Maybe so that you can run blankslate --release and it either formalises and releases, or just releases based on what’s existing (so that it’s the same workflow no matter how far through the project you are, and can also validate and update projects alongside Blankslate’s own evolution). Look into cookiecutter, too.\n De-Google Part 1 and Part 2.\n Edit my unkokaeru repo on GitHub so that tamago.tech’s homepage shows all of its sub-repos.\n How do I use my Lunalite light meter?\n\n\nAcademic\n\n Prepare for the second year of university.\n\n\nWork\n\n Write a CV, then apply to places like Tesco?\n Automate student document generation for summaries and homework + Excalidraw templates within Obsidian for export?\n Complete and extend AbrahamMD to generate content for GCSE and A-Level. Maybe even turn it into a website.\n Schedule content for the Tutoring With Will social media.\n\n TikTok: Study with me, study technique tier list (series), motivation/romanticising studying/life, etc.\n Instagram: Study schedules/plans, how to take notes, etc.\n Facebook: Straight advertising.\n YouTube: Lessons on topics - book a lecture room?\n\n\n\n\nname Open VS Code\ntype command\naction Python Scripter: Run open_vscode.py\ncolor default\nname Open Arc Browser\ntype command\naction Python Scripter: Run open_arc.py\ncolor default"},"Unorganised/Random-Thoughts":{"title":"Random Thoughts","links":["tags/random"],"tags":["random"],"content":"random\n\nIf someone else aligns with your values, then you’ll inherently respect them. By extension, if someone wants your respect, then they should align with your values. so, why don’t you align with your own values? If you do, then you’ll probably respect yourself - hold yourself to the values that you hold others to, and you’ll be a lot happier.\n\nJustice always triumphs, but not because it’s inherently better, it’s just that the winners of any battle are the ones that then write the history books.\n\n“The Architecture of Happiness” by Alain de Botton: Style represents what the appreciator lacks: formerly perhaps structure and simplicity, currently perhaps expression and freedom.\n\nMost people think of a cold showers as a test of endurance similar to that of an ice bath. However, the benefits come because of the shock, not hypothermia. If you stand under the shower whilst it heats it, focusing on your breathing, it feels amazing afterwards. Basically, cold shock showers are great, cold showers suck.\n\nCool child names: Otto, Evelyn, Tio."},"Unorganised/Side-Quests":{"title":"Side Quests","links":["tags/questlog","Unorganised/Main-Quests","Unorganised/Grinding","Trip-to-Tokyo,-Japan"],"tags":["questlog"],"content":"questlog\nJust stuff I want to do at some point, but don’t need to do right now :)\nRelated: Main Quests and Grinding.\n\nProgramming\n\n Create a mood tracker app utilising notifications to track mood.\n Create a bouncing ball physics simulation.\n Create a Bitlife achievement route generator and tracker.\n Look into putting a custom OS onto my Kindle.\n Create a Rubik’s cube visualiser that links (via Bluetooth) to my physical smart cube. Future additions to the program could include a scrambler, auto-timer, and [algorithm](Learn how to solve the Rubik’s Cube) practice.\n Create an OSINT Python script that intakes all information you have of someone and then tries to find more - minimal information could simple be a name, maybe an age. Some related videos here and here.\n Heroku Python hosting?\n\n\nMedia Consumption\n\n Invincible (Prime TV).\n Shogun (Disney+).\n One Piece (Crunchyroll).\n\n\nSocial Planning\n\n Plan my Trip to Tokyo, Japan (with my brother).\n\n\nSibling Competition\n\n Make music!\n Practice Rubik’s cubing: sub 90 second time?\n\n\nResearch\n\n Look into taxes, self-employment tax, expenses whilst self-employed, banking, etc.\n Look into nutrition and dermatology.\n Write notes on Behavioural and Substance Addiction.\n Create a verbose family tree (that I update annually) using tools like Ancestry, etc.\n\n\nRequires Money\n\n Fix the golden touchscreen laptop: replace the charging port? Remember to secure the battery again, too.\n Buy some soap magnets, new rubber gloves, a dish brush and sponges, as well as body stuff.\n Send my Fujifilm camera for repair.\n Fix my old keyboard: re-solder the cable and remove dust from keys.\n Try fixing, repurposing, or selling any other old devices I own.\n Buy some temporary tattoos.\n Get some Jibbitz.\n Raspberry Pi 5 - self-hosting.\n Desk fan?\n Microphone?\n 3D pen?\n"},"Unorganised/Unorganised":{"title":"Unorganised","links":["tags/"],"tags":["index"],"content":"index\nid: 5d01fe4a-0505-4c8d-b4cb-fb3fb4cc5031\nfolderPath: &quot;&quot;\ntitle: &quot;{{folderName}} overview&quot;\nshowTitle: false\ndepth: 10\nincludeTypes:\n  - folder\n  - markdown\nstyle: list\ndisableFileTag: false\nsortBy: name\nsortByAsc: true\nshowEmptyFolders: true\nonlyIncludeSubfolders: false\nstoreFolderCondition: true\nshowFolderNotes: true\ndisableCollapseIcon: true"},"index":{"title":"index","links":["tags/","tags/todo"],"tags":["index","todo"],"content":"indextodo\n\n\n                  \n                  Work in progress!! \n                  \n                \n\nname Sync Quartz\ntype command\naction Python Scripter: Run sync_quartz.py\ncolor default"}}