{"Auto-Generated/AI-Chats/AI-Chats":{"title":"AI Chats","links":["tags/"],"tags":["index"],"content":"index\nid: c31f9cc3-1c09-451a-8008-61bcf75e3310\nfolderPath: &quot;&quot;\ntitle: &quot;{{folderName}} overview&quot;\nshowTitle: false\ndepth: 10\nincludeTypes:\n  - folder\n  - markdown\nstyle: list\ndisableFileTag: false\nsortBy: name\nsortByAsc: true\nshowEmptyFolders: true\nonlyIncludeSubfolders: false\nstoreFolderCondition: true\nshowFolderNotes: true\ndisableCollapseIcon: true"},"Auto-Generated/AI-Chats/CV-Chat-(WIP)":{"title":"CV Chat (WIP)","links":["Unorganised/Brother-CV","Unorganised/Mother-CV"],"tags":[],"content":"user: Read my Brother CV and Mother CV. They’re older and more experienced than me, I’m still an undergraduate student without any formal work experience beyond being a self-employed tutor for the past few years alongside my studies. I want a job in retail though (like Tesco). Please write me a CV that can help me with this, that I can then refine and tweak to my liking - I just need help starting. Before doing so, ask me as many questions as you need to ascertain what to write about - I’d rather ask 100 questions than have a bad result from you.\nThank you!\nai: Great! To help you create a CV tailored for a retail position, I’ll need to gather some information about your background, skills, and preferences. Here are some questions to get us started:\nPersonal Information\n\nWhat is your full name?\nWhat is your contact information (phone number, email)?\nDo you have a LinkedIn profile or personal website you would like to include?\n\nEducation\n\nWhat is your current degree program and university?\nWhat year are you in (e.g., first year, second year)?\nAre there any relevant courses or projects you’ve completed that relate to retail or customer service?\n\nWork Experience\n\nCan you describe your experience as a self-employed tutor? What subjects do you teach, and what skills have you developed through this role?\nHave you had any other informal work experiences (e.g., volunteering, internships) that could be relevant to a retail position?\nDo you have any experience handling cash, managing inventory, or providing customer service?\n\nSkills\n\nWhat specific skills do you possess that would be valuable in a retail environment (e.g., communication, teamwork, problem-solving)?\nAre you familiar with any retail software or point-of-sale systems?\n\nAvailability\n\nWhat is your availability for work (e.g., full-time, part-time, specific days/times)?\nAre you open to working weekends or holidays?\n\nAdditional Information\n\nDo you have any certifications or training that might be relevant (e.g., customer service training)?\nWhat are your career goals, and how does this retail position fit into them?\nIs there anything else you would like to highlight in your CV (e.g., hobbies, interests, languages spoken)?\n\nFeel free to answer as many questions as you can, and we can build your CV from there!\nuser: 1. William Fayers\n2. 07578 127943, william@fayers.com\n3. www.linkedin.com/in/william-fayers/, bilbois.me/\n4. BSc (Hons) Mathematics at the University of Lincoln\n5. Second year\n6. I did a group project which involved a lot of teamwork and communication, if that counts? I was the secretary in the group, so I mainly handled communication, organisation/timings and resolving internal conflict, as well as more standard note taking and contribution to the group project.\n7. I teach maths as I enjoy it and it helps me pass on the knowledge I learn in my day-to-day, as well as chemistry and physics (my two other former A-Level specialities) to try and stay on top of old knowledge so I don’t forget the interesting things I’ve learned. Generally, I just do it to help my community, though - it’s very rewarding. I’ve learned how to deal with customers in a professional manner and motivate unwilling students to try their best, as well as learning to understand what my students are thinking; whilst often it feels like what they’re feeling or thinking is unreasonable or illogical, it’s often understandable once you try to think like they do and empathise with their situation - usually you’re just not seeing the whole picture, so I’ve learned that it really helps to try and understand the student, or customer, when providing them a service, to ensure every goes smoothly.\n8. I often volunteered with the Air Cadets before going to university and I’ve been in student leader positions throughout my entire education, if that counts?\n9. I handle cash when tutoring and provide customer service when tutoring.\n10. The stereotypical ones - you can get these from what I’ve said and extrapolation of my character, I can always correct them (just assume I’m perfect I guess).\n11. No.\n12. Part-time at the weekend, once I have a timetable for my second year of uni then this might open up more to times during weekdays or evenings.\n13. Weekends.\n14. No.\n15. I want to gain more experience working directly with customers in person as well as working within a team to hopefully help me with future career aspirations.\n16. I love chess, programming, learning languages like Japanese French German, as well as crochet and painting, and reading books, going to the gym and playing pool with friends.\nIf you have any further questions before you build the CV, please ask!\nai: Thank you for providing such detailed information! This will help create a strong CV for your retail job application. Before I draft the CV, I have a few more questions to ensure we capture everything accurately:\nAdditional Questions\n\nReferences: Would you like to include references on your CV, or would you prefer to state that they are available upon request?\nObjective Statement: Would you like to include a brief objective statement at the top of your CV to summarize your goals and what you bring to a retail position?\nFormatting Preferences: Do you have any specific formatting preferences (e.g., font style, color, layout) for your CV?\nAchievements: Are there any specific achievements or recognitions from your tutoring or volunteer experiences that you would like to highlight?\nLocation: Would you like to include your address or just your city and postcode?\n\nOnce I have this information, I can create a draft CV for you!\nuser: 1. I guess they’d be available upon request? I’m not sure what would be expected here or who could even be one - maybe my tutor?\n2. If that’s normal, yes.\n3. Markdown, similar to what you read at the beginning of our conversion.\n4. I’ve been lucky enough to get an Arkwright Engineering Scholarship, among a plethora of other things but I guess you only need one.\n5. Lincoln, LN1 1UR.\nOh also, do you want my GCSE and A-Levels before you draft the CV?\nai: Thank you for the additional details! Including your GCSE and A-Level information will definitely enhance your CV, especially since you’re still an undergraduate. Please provide the following:\n\nA-Level Subjects and Grades: What subjects did you take, and what grades did you achieve?\nGCSE Subjects and Grades: What subjects did you take, and what grades did you achieve?\n\nOnce I have that information, I can draft your CV!\nuser: 1. Extended Project (Level 3) Grade A, Chemistry Grade C, Physics Grade C, Further Mathematics Grade B, Mathematics Grade A\n2. Free-Standing Mathematics Qualification Grade A, Grade 7: Astronomy, English Language, Biology, Grade 8: History, German, French, English Literature, Computer Science, Chemistry, Physics, Mathematics\nai: Great! Thank you for providing your A-Level and GCSE details. Here’s a draft CV based on all the information you’ve shared. You can refine and tweak it as needed.\n\nWilliam Fayers\nLincoln, LN1 1UR\n07578 127943\nwilliam@fayers.com\nLinkedIn | Website\n\nObjective\nEnthusiastic and motivated undergraduate student seeking a part-time retail position to gain hands-on experience in customer service and teamwork. Eager to apply strong communication skills and a passion for helping others to create a positive shopping experience.\n\nEducation\nBSc (Hons) Mathematics\nUniversity of Lincoln, Lincoln, England\nExpected Graduation: 2025\n\nSecond Year Student\n\nA Levels\n\nExtended Project (Level 3): Grade A\nMathematics: Grade A\nFurther Mathematics: Grade B\nChemistry: Grade C\nPhysics: Grade C\n\nGCSEs\n\nFree-Standing Mathematics Qualification: Grade A\nAstronomy: Grade 7\nEnglish Language: Grade 8\nBiology: Grade 8\nHistory: Grade 8\nGerman: Grade 8\nFrench: Grade 8\nEnglish Literature: Grade 8\nComputer Science: Grade 8\nChemistry: Grade 7\nPhysics: Grade 7\nMathematics: Grade 7\n\n\nExperience\nSelf-Employed Tutor\n2019 - Present\n\nProvided tutoring in Mathematics, Chemistry, and Physics to students of various ages, enhancing their understanding and performance in these subjects.\nDeveloped strong customer service skills by effectively communicating with students and parents, addressing concerns, and adapting teaching methods to meet individual needs.\nFostered a supportive learning environment, motivating students to engage with the material and achieve their academic goals.\n\nVolunteer, Air Cadets\n2017 - 2019\n\nEngaged in various community service projects, developing teamwork and leadership skills while working with peers to achieve common goals.\nAssisted in organizing events and activities, enhancing organizational and communication abilities.\n\n\nSkills\n\nStrong communication and interpersonal skills\nTeamwork and collaboration\nProblem-solving and conflict resolution\nCash handling and customer service\nTime management and organizational skills\nEmpathy and understanding of customer needs\n\n\nAchievements\n\nAwarded the Arkwright Engineering Scholarship for demonstrating exceptional potential in engineering and technology.\n\n\nInterests\n\nChess, programming, and learning languages (Japanese, French, German)\nCrochet, painting, reading, and fitness activities (gym, swimming, walking)\nPlaying pool with friends\n\n\nReferences\nAvailable upon request.\n\nFeel free to adjust any sections, add more details, or change the formatting as you see fit! If you have any further questions or need additional changes, just let me know!"},"Auto-Generated/AI-Chats/Chat-2024_09_23-16_30_07":{"title":"Chat-2024_09_23-16_30_07","links":["Unorganised/Random-Notes---Algebraic-Structures","tags/"],"tags":[""],"content":"user: Extend Random Notes - Algebraic Structures with a short section on the last ten slides of the slideshow pdf linked at the end of the note, where the slides talk about Direct Products of groups/sets and if they’re groups, with examples\nai: Direct Products of Groups/Sets\nThe direct product of two algebraic structures, such as groups or sets, is a way to combine them into a new structure. If we have two groups ( G ) and ( H ), their direct product, denoted ( G \\times H ), consists of all ordered pairs ( (g, h) ) where ( g \\in G ) and ( h \\in H ). The operation on this product is defined component-wise.\nDefinition\nFor ( G ) and ( H ) to form a direct product ( G \\times H ), the following must hold:\n\nClosure: If ( (g_1, h_1), (g_2, h_2) \\in G \\times H ), then ( (g_1, h_1) * (g_2, h_2) = (g_1 * g_2, h_1 * h_2) ) is also in ( G \\times H ).\nAssociativity: The operation is associative, meaning ( ((g_1, h_1) * (g_2, h_2)) * (g_3, h_3) = (g_1, h_1) * ((g_2, h_2) * (g_3, h_3)) ).\nIdentity Element: The identity element of ( G \\times H ) is ( (e_G, e_H) ), where ( e_G ) and ( e_H ) are the identity elements of ( G ) and ( H ), respectively.\nInverses: For each ( (g, h) \\in G \\times H ), there exists an inverse ( (g^{-1}, h^{-1}) ) such that ( (g, h) * (g^{-1}, h^{-1}) = (e_G, e_H) ).\n\nExamples\n\n\nExample with Groups: Let ( G = \\mathbb{Z}/2\\mathbb{Z} ) (the integers modulo 2) and ( H = \\mathbb{Z}/3\\mathbb{Z} ) (the integers modulo 3). The direct product ( G \\times H ) consists of the pairs ( (0,0), (0,1), (0,2), (1,0), (1,1), (1,2) ). This set forms a group under component-wise addition modulo 2 and 3, respectively.\n\n\nExample with Sets: Consider two sets ( A = {1, 2} ) and ( B = {x, y} ). The direct product ( A \\times B ) is the set of ordered pairs ( {(1, x), (1, y), (2, x), (2, y)} ). While this is not a group, it illustrates the concept of combining sets.\n\n\nConclusion\nThe direct product of groups is itself a group, provided that the original structures are groups. This construction allows for the exploration of more complex algebraic structures by combining simpler ones, enriching our understanding of their properties and behaviors."},"Auto-Generated/AI-Chats/Cookie-Cutter-Chat":{"title":"Cookie Cutter Chat","links":[],"tags":[],"content":"user: Can you walk me through how and why I’d use cookiecutter in Python?\nai: Certainly! Cookiecutter is a command-line utility that creates projects from cookiecutters (project templates). It’s particularly useful in Python development for generating boilerplate code and project structures, which can save time and ensure consistency across projects.\nWhy Use Cookiecutter?\n\nStandardization: It helps maintain a consistent project structure across multiple projects, making it easier for teams to collaborate.\nSpeed: Quickly scaffold new projects without having to set up everything from scratch.\nCustomization: You can create your own templates or use existing ones tailored for specific frameworks or libraries.\nBest Practices: Many cookiecutters are designed with best practices in mind, helping you start your project on the right foot.\n\nHow to Use Cookiecutter\nStep 1: Install Cookiecutter\nYou can install Cookiecutter using pip. Open your terminal and run:\npip install cookiecutter\nStep 2: Find a Cookiecutter Template\nYou can create your own template or use existing ones. There are many templates available on GitHub and other repositories. For example, you can find popular templates for Python projects at cookiecutter-pypackage.\nStep 3: Create a New Project\nTo create a new project using a cookiecutter template, run the following command in your terminal:\ncookiecutter &lt;template-url&gt;\nFor example, to use the cookiecutter-pypackage template, you would run:\ncookiecutter github.com/audreyfeldroy/cookiecutter-pypackage\nStep 4: Answer the Prompts\nAfter running the command, Cookiecutter will prompt you for various inputs based on the template. These might include:\n\nProject name\nAuthor name\nLicense type\nVersion number\n\nFill in the prompts as required. Cookiecutter will then generate a new directory with the project structure based on your inputs.\nStep 5: Navigate to Your New Project\nOnce the project is created, navigate into the new project directory:\ncd &lt;project-name&gt;\nStep 6: Start Developing\nNow you can start developing your project! The generated structure will typically include directories for source code, tests, documentation, and configuration files.\nExample of a Simple Cookiecutter Template\nIf you want to create your own template, here’s a simple structure you can follow:\n\nCreate a new directory for your template, e.g., cookiecutter-myproject.\nInside this directory, create a cookiecutter.json file to define the variables:\n\n{\n    &quot;project_name&quot;: &quot;My Project&quot;,\n    &quot;author_name&quot;: &quot;Your Name&quot;,\n    &quot;version&quot;: &quot;0.1.0&quot;\n}\n\nCreate a directory structure that uses these variables. For example:\n\ncookiecutter-myproject/\n├── cookiecutter.json\n└── {{ cookiecutter.project_name }}/\n    ├── README.md\n    └── setup.py\n\nIn README.md, you can use placeholders like:\n# {{ cookiecutter.project_name }}\n\nAuthor: {{ cookiecutter.author_name }}\nVersion: {{ cookiecutter.version }}\n\nConclusion\nCookiecutter is a powerful tool for Python developers that can streamline the project creation process. By using or creating templates, you can ensure that your projects are well-structured and follow best practices, allowing you to focus more on coding and less on setup."},"Auto-Generated/Attachments/Sudokus/Sudokus":{"title":"Sudokus","links":["tags/sudoku","tags/"],"tags":["sudoku","index"],"content":"sudokuindex\nid: 9af4a5b2-4579-4487-b216-2b5e2c3c65a4\nfolderPath: &quot;&quot;\ntitle: &quot;{{folderName}} overview&quot;\nshowTitle: false\ndepth: 10\nstyle: list\nincludeTypes:\n  - folder\n  - markdown\n  - image\ndisableFileTag: false\nsortBy: name\nsortByAsc: true\nshowEmptyFolders: true\nonlyIncludeSubfolders: false\nstoreFolderCondition: true\nshowFolderNotes: true\ndisableCollapseIcon: true"},"Daily-Notes/Daily-Notes":{"title":"Daily Notes","links":[],"tags":[],"content":"id: 9fdf2bd2-13ce-43e5-b201-17e9451c6c79\nfolderPath: &quot;&quot;\ntitle: &quot;{{folderName}} overview&quot;\nshowTitle: false\ndepth: 10\nstyle: list\nincludeTypes:\n  - folder\n  - markdown\ndisableFileTag: false\nsortBy: name\nsortByAsc: true\nshowEmptyFolders: true\nonlyIncludeSubfolders: false\nstoreFolderCondition: true\nshowFolderNotes: true\ndisableCollapseIcon: true"},"Main-Vibes/Grinding":{"title":"Grinding","links":["tags/questlog","Main-Vibes/Main-Quests","Main-Vibes/Side-Quests"],"tags":["questlog"],"content":"questlog\nStuff that I need to do, but don’t really want to :)\nRelated: Main Quests and Side Quests.\n\nChores\n\n Vacuum.\n Washing.\n"},"Main-Vibes/Main-Quests":{"title":"Main Quests","links":["tags/questlog","Main-Vibes/Side-Quests","Main-Vibes/Grinding","Unorganised/Convenience-Store-Challenge","Unorganised/Video-Length-Conversion-Challenge","Unorganised/Random-Notes---Coding-Theory-1","Unorganised/Random-Notes---Coding-Theory-2","Unorganised/Random-Notes---Algebraic-Structures","Unorganised/Random-Notes---Differential-Equations","Unorganised/Random-Notes---Lagrangian-and-Hamiltonian-Mechanics","Unorganised/application-supporting-statements","Unorganised/William-Fayers"],"tags":["questlog"],"content":"questlog\nStuff I want do and need to do :)\nRelated: Side Quests and Grinding.\n\nPersonal\n\n Finish all of my programming projects.\n\n AbrahamMD.\n\n Use classes for everything and 4o-mini for content generation.\n Extend to generate GCSE and A-Level content.\n Convert to a website?\n\n\n ASCII Photo (PNG to ASCII art).\n Chess Mini Me.\n Random Challenges.\n\n Convenience Store Challenge.\n Video Length Conversion Challenge.\n\n\n Dailies.\n Error Correction.\n JSON Comparison.\n Markdown Merger.\n Minesweeper.\n Morning Briefing Generation.\n PGN to JSON Converter.\n QR Gen (QR Art Generation).\n Rate List.\n Untitledobsidianproject.\n\n\n Modify my Quartz workflow to convert appropriate code blocks to static markdown when building HTML.\n De-Google.\n\n Migrate authentication apps to a single place.\n Obtainium.\n Self-host photos.\n Self-host password manager.\n Self-host cloud storage.\n\n\n Upgrade my USB to automatically setup Arc, Obsidian/Quartz, and VS Code.\n Go through my GitHub Issues.\n\n\nAcademic\n\n Go over first week notes…\n\n Random Notes - Coding Theory 1,\n Random Notes - Coding Theory 2,\n Random Notes - Algebraic Structures,\n Random Notes - Differential Equations,\n Random Notes - Lagrangian and Hamiltonian Mechanics. Add physical notes into these, too.\n\n\n Revise first year, especially the Algebra module.\n\n\nWork\n\n Automate student document generation for summaries and homework + Excalidraw templates within Obsidian for export?\n Apply to be a student ambassador (with this link) before Monday 7th October, after answering the application supporting statements.\n Look into placements on CareerLinc, GradCracker, and RateMyPlacement.\n Review and improve my CV!\n Schedule content for the Tutoring With Will social media.\n\n TikTok: Study with me, study technique tier list (series), motivation/romanticising studying/life, etc.\n Instagram: Study schedules/plans, how to take notes, etc.\n Facebook: Straight advertising.\n YouTube: Lessons on topics - book a lecture room?\n “Handwritten pace to prevent being overwhelmed.”\n\n\n\n\nname Open VS Code\ntype command\naction Python Scripter: Run open_vscode.py\ncolor default\nname Open Arc Browser\ntype command\naction Python Scripter: Run open_arc.py\ncolor default"},"Main-Vibes/Main-Vibes":{"title":"Main Vibes","links":["Main-Vibes/William-Fayers.docx"],"tags":[],"content":"Welcome to my main hub! Below are my essential to-do lists and notes that I use almost every day.\nFeel free to explore!\n\nid: df0e0be4-1968-4a96-a8dc-99d47f227cb8\nfolderPath: &quot;&quot;\ntitle: &quot;{{folderName}}&quot;\nshowTitle: false\ndepth: 10\nstyle: list\nincludeTypes:\n  - folder\n  - markdown\ndisableFileTag: false\nsortBy: modified\nsortByAsc: false\nshowEmptyFolders: true\nonlyIncludeSubfolders: false\nstoreFolderCondition: false\nshowFolderNotes: true\ndisableCollapseIcon: true\nHere’s my CV in docx, too (until I make this a proper section): William Fayers.docx.\n\n\n\n                  \n                  Note\n                  \n                \n\nThe code block below is a button I use to sync and build my vault notes with Quartz. It may look like random code here, but it helps keep everything updated in my workspace.\n\n\nname Sync Quartz\ntype command\naction Python Scripter: Run sync_quartz.py\ncolor default\n"},"Main-Vibes/Random-Thoughts":{"title":"Random Thoughts","links":["tags/random"],"tags":["random"],"content":"random\n\nIf someone else aligns with your values, then you’ll inherently respect them. By extension, if someone wants your respect, then they should align with your values. so, why don’t you align with your own values? If you do, then you’ll probably respect yourself - hold yourself to the values that you hold others to, and you’ll be a lot happier.\n\nJustice always triumphs, but not because it’s inherently better, it’s just that the winners of any battle are the ones that then write the history books.\n\n“The Architecture of Happiness” by Alain de Botton: Style represents what the appreciator lacks: formerly perhaps structure and simplicity, currently perhaps expression and freedom.\n\nMost people think of a cold showers as a test of endurance similar to that of an ice bath. However, the benefits come because of the shock, not hypothermia. If you stand under the shower whilst it heats it, focusing on your breathing, it feels amazing afterwards. Basically, cold shock showers are great, cold showers suck.\n\nCool child names: Otto, Evelyn, Tio."},"Main-Vibes/Side-Quests":{"title":"Side Quests","links":["tags/questlog","Main-Vibes/Main-Quests","Main-Vibes/Grinding","Trip-to-Tokyo,-Japan"],"tags":["questlog"],"content":"questlog\nJust stuff I want to do at some point, but don’t need to do right now :)\nRelated: Main Quests and Grinding.\n\nProgramming\n\n Create a programming portfolio on tamago.tech within the unkokaeru repo.\n\n Heroku Python hosting?\n\n\n New domain?\n Develop dynamic holiday planner, mainly to dynamically predict cost.\n Make a neural network from scratch, to learn about it all.\n Create a mood tracker app utilising notifications to track mood.\n Create a bouncing ball physics simulation.\n Create a Bitlife achievement route generator and tracker.\n Look into putting a custom OS onto my Kindle.\n Create a Rubik’s cube visualiser that links (via Bluetooth) to my physical smart cube. Future additions to the program could include a scrambler, auto-timer, and [algorithm](Learn how to solve the Rubik’s Cube) practice.\n Create an OSINT Python script that intakes all information you have of someone and then tries to find more - minimal information could simple be a name, maybe an age. Some related videos here and here.\n\n\nMedia Consumption\n\n Invincible (Prime TV).\n Shogun (Disney+).\n One Piece (Crunchyroll).\n\n\nSocial Planning\n\n Plan my Trip to Tokyo, Japan (with my brother).\n\n\nSibling Competition\n\n Make music!\n Practice Rubik’s cubing: sub 90 second time?\n\n\nResearch\n\n How do I use my Lunalite light meter?\n Look into taxes, self-employment tax, expenses whilst self-employed, banking, etc.\n Look into nutrition and dermatology.\n Write notes on Behavioural and Substance Addiction.\n Create a verbose family tree (that I update annually) using tools like Ancestry, etc.\n\n\nRequires Money\n\n Fix the golden touchscreen laptop: replace the charging port? Remember to secure the battery again, too.\n Buy some soap magnets, new rubber gloves, a dish brush and sponges, as well as body stuff.\n Send my Fujifilm camera for repair.\n Fix my old keyboard: re-solder the cable and remove dust from keys.\n Try fixing, repurposing, or selling any other old devices I own.\n Buy some temporary tattoos.\n Get some Jibbitz.\n Raspberry Pi 5 - self-hosting.\n Desk fan?\n Microphone?\n 3D pen?\n"},"Organised/Chess/Chess-Games/Chess-Games":{"title":"Chess Games","links":["tags/","tags/chess","tags/todo"],"tags":["index","chess","todo"],"content":"indexchesstodo\nid: 5641db88-aeb7-4060-98f2-ba6c13511b92\nfolderPath: &quot;&quot;\ntitle: &quot;{{folderName}} overview&quot;\nshowTitle: false\ndepth: 10\nincludeTypes:\n  - folder\n  - markdown\nstyle: list\ndisableFileTag: false\nsortBy: name\nsortByAsc: true\nshowEmptyFolders: true\nonlyIncludeSubfolders: false\nstoreFolderCondition: true\nshowFolderNotes: true\ndisableCollapseIcon: true\nname Create note from template\ntype command\naction Templater: Create new note from template\ncolor default"},"Organised/Chess/Chess-Openings/Chess-Openings":{"title":"Chess Openings","links":["tags/","tags/chess","tags/todo"],"tags":["index","chess","todo"],"content":"indexchesstodo\nid: 5ce652e5-7b19-4bf9-8756-23cc82534791\nfolderPath: &quot;&quot;\ntitle: &quot;{{folderName}} overview&quot;\nshowTitle: false\ndepth: 10\nincludeTypes:\n  - folder\n  - markdown\nstyle: list\ndisableFileTag: false\nsortBy: name\nsortByAsc: true\nshowEmptyFolders: true\nonlyIncludeSubfolders: false\nstoreFolderCondition: true\nshowFolderNotes: true\ndisableCollapseIcon: true\nname Create note from template\ntype command\naction Templater: Create new note from template\ncolor default"},"Organised/Craft/Crochet/Crochet":{"title":"Crochet","links":["tags/","tags/craft","tags/crochet","tags/todo"],"tags":["index","craft","crochet","todo"],"content":"indexcraftcrochettodo"},"Organised/Craft/Scrapbooking/Scrapbooking":{"title":"Scrapbooking","links":["tags/","tags/craft","tags/scrapbooking","tags/todo"],"tags":["index","craft","scrapbooking","todo"],"content":"indexcraftscrapbookingtodo"},"Organised/Health/Calisthenics/Calisthenics":{"title":"Calisthenics","links":["tags/","tags/health","tags/calisthenics","tags/fitness","tags/todo"],"tags":["index","health","calisthenics","fitness","todo"],"content":"indexhealthcalisthenicsfitnesstodo\nLog? Routines? Research?\n\nAlberto Nuñez Upper Lower\n\nBoostcamp\nReddit\nStronger247\nBodybuilding Forum\nScribd\n\n\n"},"Organised/Health/Energy-Beverages":{"title":"Energy Beverages","links":["tags/rando","tags/health","tags/todo"],"tags":["rando","health","todo"],"content":"randohealthtodo\nwww.ncbi.nlm.nih.gov/pmc/articles/PMC2966367/\nwww.youtube.com/watch"},"Organised/Health/One-Rep-Max-Calculations":{"title":"One-Rep Max Calculations","links":["tags/health","tags/fitness","tags/1RM"],"tags":["health","fitness","1RM"],"content":"healthfitness1RM\nTo calculate the maximum weight I can lift (1RM), I use various formulas. The Brzycki, Epley, and Lander formulas yield pretty accurate results, while the Lombardi and O’Conner formulas tend to underestimate, and the Mayhew and Wathan formulas overestimate.\n\nFormulae\n\nBrzycki: weight × (36 / (37 - reps))\nEpley: weight × (1 + 0.0333 × reps)\nLander: (100 × weight) / (101.3 - 2.67123 × reps)\nLombardi: weight × reps ^ 0.1\nMayhew et al.: (100 × weight) / (52.2 + (41.9 × e-0.055 × reps))\nO’Conner et al.: weight × (1 + 0.025 × reps)\nWathan: (100 × weight) / (48.8 + (53.8 × e ^ -0.075 × reps))\n\nYou can read more about these formulas in this NIH article."},"Organised/Health/Oral-Care":{"title":"Oral Care","links":["tags/health","tags/oralcare","tags/todo"],"tags":["health","oralcare","todo"],"content":"healthoralcaretodo\nOral care forms a crucial part of my health routine. It involves flossing, brushing, tongue scraping, mouth rinsing, and teeth whitening.\n\nFlossing\nFlossing helps get between your teeth before brushing. It covers about 40% of your tooth surface, so not flossing is similar to not washing your legs in the shower. Regular flossing helps prevent plaque, tartar, inflammation, and eventual bone loss leading to missing teeth.\n\nlittlesmilesofdelaware.com/blog/how-flossing-helps.\ndentalhealthtoday.com/index.html.\nwww.cosmetic-dentistry.net/post/5-things-that-will-change-your-mind-about-flossing.\n\n\nBrushing\nBrushing not only cleans your teeth but also your gums. A significant part of brushing should be at the border between your teeth and gums. To reach the back of your teeth, move your jaw along with the area you’re trying to clean. Both electric and manual toothbrushes can be effective, but studies show that electric toothbrushes can be more efficient when used correctly.\n\nTongue Scraping\nTongue scraping helps freshen breath by removing sulphur compounds and bacteria from the back of your tongue. You can use a toothbrush for the same purpose, but a hard scraper tends to be more efficient at removing the “gunk.”\n\nMouth Rinse\nA non-alcohol mouth rinse with a pH greater than 5.5 helps remineralise your teeth. It reaches areas that are easy to miss. However, ensure the rinse is not too acidic (less than 5.5 pH), which can demineralise your teeth. Also, avoid alcohol-containing mouth rinses as they can dry out your mouth, increasing the risk of cavities.\n\nWhitening\nTeeth, by their nature, come in a variety of hues and shades, including yellow. The prevailing societal beauty standard, however, promotes the idea of perfectly white teeth. This standard, when met, can potentially have a positive impact on an individual’s mental health, as it could boost self-esteem and confidence.\nIn our daily diet, we consume numerous colourful and acidic foods and drinks that can lead to the staining of our teeth. This includes items such as coffee, tea, red wine, and certain fruits like berries. Despite their potential to stain, it’s important to note that these foods and drinks can be enjoyed without causing permanent damage to the colour of our teeth. A simple preventive measure is to rinse the mouth with water immediately after consumption. This strategy helps to remove the staining compounds before they have a chance to adhere to the tooth enamel.\nHowever, it’s important to remember that brushing your teeth should be avoided for at least half an hour after eating or drinking these substances. Contrary to what one might think, brushing within the first half-hour can actually exacerbate the staining. This is because the acidity from the food or drink can temporarily soften the tooth enamel, making it more susceptible to abrasion from brushing.\nTo combat existing stains, there are a number of methods one can use. One particularly effective method is the use of hydrogen peroxide, a common ingredient in many whitening products. Hydrogen peroxide oxidizes the stains, effectively breaking them down and revealing a whiter surface underneath.\nAnother method is mechanical stain removal, which can be performed by a dentist or dental hygienist. This process involves physically removing the stains using special dental tools. While this method can be quite effective, it’s important to note that it should be done under professional supervision to avoid damaging the tooth enamel.\nIn conclusion, maintaining a healthy and aesthetically pleasing smile involves understanding the nature of teeth, practicing good dietary habits, and using appropriate stain removal methods."},"Organised/Health/Planning-Exercise":{"title":"Planning Exercise","links":["tags/health","tags/fitness","tags/todo","Organised/Health/One-Rep-Max-Calculations"],"tags":["health","fitness","todo"],"content":"healthfitnesstodo\nBefore a workout, do a warm-up set with 40% of the maximum weight for 5 reps, 60% for 5 reps, and 80% for 3 reps."},"Organised/Health/Sleep/Sleep":{"title":"Sleep","links":["tags/","tags/sleep","tags/health","tags/todo"],"tags":["index","sleep","health","todo"],"content":"indexsleephealthtodo\nPolyphasic, monophasic, sleep stages, dreaming, REM, sleep pressure, circadian rhythm, health risks, sleep schedules, sleep log(s)."},"Organised/Languages/Languages":{"title":"Languages","links":["tags/language","tags/","tags/todo"],"tags":["language","index","todo"],"content":"languageindextodo\nJapanese, German, French, Spanish, Italian, British Sign Language?"},"Organised/Music/Music-Production/Music-Production":{"title":"Music Production","links":["tags/music","tags/production","tags/todo"],"tags":["music","production","todo"],"content":"musicproductiontodo"},"Organised/Music/Piano/Piano":{"title":"Piano","links":["tags/music","tags/piano","tags/todo"],"tags":["music","piano","todo"],"content":"musicpianotodo"},"Organised/Pedagogy/Pedagogy":{"title":"Pedagogy","links":["single-system","tags/pedagogy","tags/","tags/todo","Highlighting-and-Annotating","Flashcards-and-Spaced-Repetition","Sleep-and-Learning","Preparation-for-Learning","Characteristics-of-Sleep","Memory-Science","Eisenhower-Matrix","Physical-and-Cognitive-Connection","Prioritizing-Tasks","Nutrition-in-Cognitive-Function","Exercise-and-the-Brain","Impact-of-Sleep-on-Learning","Polyphasic-Sleep-Patterns","Circadian-Rhythms-in-Learning","Optimization-of-Learning-Through-Sleep","Enhancing-Cognitive-Performance","Figure-5:-Bloom's-Taxonomy"],"tags":["pedagogy","index","todo"],"content":"A new journaling system. Commonplacing. Traveller’s Notebook. How we learn. Develop and integrate a single system, adding to and refining it.\npedagogyindextodo\nPedagogy: The Art and Science of Learning\nIntroduction\nIn the realm of education, the distinction between studying and learning is paramount. As highlighted by Pepper (2010), the act of studying does not guarantee learning. Many students find themselves trapped in a cycle of extensive studying with minimal retention or understanding. This phenomenon raises a critical question: What does it mean to truly learn?\nLearning, unlike mere studying, is characterized by the acquisition of knowledge or skills through experience, study, or by being taught, which results in a lasting change in behaviour or understanding. It is an active, not passive, process that involves engagement and the application of various strategies to ensure that information is not only consumed but internalized.\nActive vs. Passive Study Techniques\nStudents often default to passive study tactics, such as highlighting text, which may not be as effective as more active techniques like flashcards. The key is not the quantity of time spent studying but the quality of that time. This is analogous to an athlete’s training regimen: the benefits derived from a 20-minute high-intensity interval training (HIIT) session far exceed those from a leisurely 20-minute walk. The same principle applies to studying—the outcome is contingent upon the nature of the effort, not the duration (Pepper, 2010).\nThe Role of Sleep in Learning\nThe interplay between sleep and learning is intricate and significant. Wang et al. (2020) suggest that improved sleep quality is positively correlated with better learning outcomes. This dissertation will delve into the essential strategies for effective learning, the characteristics of sleep, and how the science of memory can be leveraged to enhance knowledge acquisition.\nIn the following sections, we will explore the methodologies and practices that can transform the act of studying into true learning. We will examine the preparatory steps one should take before engaging in study, the characteristics of sleep that influence cognitive function, and the application of memory science in educational contexts.\n\nThis note will serve as a foundational piece in understanding the broader landscape of pedagogy and its practical implications for students and educators alike. As we progress, each section will be expanded upon with evidence-based practices and theoretical frameworks that underpin the art and science of learning.\nTime Management\nTime management is a critical skill that is often misunderstood and underutilized in both academic and professional settings. According to Macan et al. (1990), effective time management is essential for success, yet it is a concept that many struggle to grasp and implement.\nThe Misconception of “Good” vs. “Bad” Students\nThe education system often promotes the idea of the “good” student as one who practices consistent, incremental study habits, embodying the “little and often” approach. Conversely, the “bad” student stereotype is associated with cramming all study into one intense session before a deadline. While cramming is widely regarded as inefficient, the urgency it creates can be a powerful motivator and a tool for time management.\nParkinson’s Law and Study Techniques\nAt the core of the debate on study habits is Parkinson’s Law, which posits that work expands to fill the time available for its completion (Bryan and Locke, 1967). This principle underlies several time management techniques, including:\nThe Pomodoro Technique\nThe Pomodoro Technique, developed by Cirillo in 2006, is a popular method involving 25 minutes of focused work followed by a 5-minute break. This cycle is repeated with longer breaks after every four intervals. Its effectiveness is attributed to the alignment with the performance pattern observed by Bligh (2000 as cited in Wilson and Korn, 2007), where attention spans tend to wane during continuous work but are rejuvenated following a break. However, due to its arbitrary nature, many find the prescribed intervals interruptive just as they reach peak focus. This has led to adaptations of the technique, such as varying the work/break intervals to suit individual preferences (Scholz, 2021).\nFlow State and Micro-Goals\nAnother approach leverages the concept of the “flow state,” where one is fully immersed and focused on the task at hand. This technique involves setting micro-goals and timing the period to reach a 25-50 percent focus level, then taking a proportional break. While subjective, this method can improve with practice and self-awareness.\nDeliberate Breaks\nRegardless of the chosen technique, the importance of deliberate breaks is emphasized (Kühnel et al, 2017). Activities such as meditation, walking, or engaging in a different form of entertainment can significantly aid in recovery and subsequent performance (Monk-Turner, 2003).\nThe 15-Minute Rule and Prioritization\nEven with effective time management techniques, students may still face the challenge of spending excessive time on unsolvable problems. The 15-minute rule (Buchanan, 2012) suggests spending a quarter of an hour attempting to solve a problem before seeking help, which can make any external assistance more effective.\nThe larger issue at hand is often poor prioritization, where trivial tasks consume valuable time. The Pareto Principle, or the 80/20 Rule, posits that 80% of outcomes are due to 20% of causes (Dunford et al, 2014). This principle underscores the importance of focusing on tasks that yield the most significant results.\nEisenhower’s Matrix\nA practical tool for prioritizing tasks is Eisenhower’s Matrix, which categorizes tasks based on urgency and importance into four quadrants. This system guides individuals to tackle urgent and important tasks first, plan for those that are important but not urgent, delegate the urgent but unimportant, and eliminate tasks that are neither urgent nor important.\nPhysical Well-being and Cognitive Performance\nFinally, it is crucial to recognize the link between physical well-being and cognitive performance. The way we spend our time should not only be efficient but also balanced, ensuring that physical health is maintained to support mental acuity.\n\nIn the subsequent sections, we will explore the relationship between physical health and cognitive function, and how to effectively allocate our most precious resource—time—to maximize learning and productivity. This will include a deeper look into the Eisenhower’s Matrix for prioritization, the connection between physical well-being and cognitive performance, and strategies for prioritizing tasks effectively.\nPhysical Aspects of Learning\nThe physical aspects of learning encompass more than just the mental effort put into studying; they involve a holistic approach that includes reading, consistent practice, and the maintenance of physical health.\nThe Five-Hour Rule\nThe concept of the five-hour rule, popularized by Michael Simmons and attributed to the practices of Benjamin Franklin, emphasizes the importance of dedicating at least one hour per day to reading and learning. This practice is not only historical but is also supported by modern research, with Kane (2014) noting that a significant majority of self-made millionaires engage in daily reading and learning activities. The consistency of this habit is crucial, as it allows for substantial knowledge acquisition over time.\nConsistency and Its Challenges\nThe year 2020, marked by the COVID-19 pandemic, underscored the importance of consistency in education. The disruption caused by the pandemic led to a decline in the effectiveness of learning due to the suspension of educational facilities (Chaturvedi et al, 2021). The lack of consistent educational engagement has been linked to educational losses on multiple levels.\nThe Impact of Physical Health on Learning\nThe pandemic also highlighted the interconnection between physical health and learning. Increased screen time has been associated with poor sleep, reduced physical activity, and subsequent mental health issues (Oswald et al, 2020). These issues can manifest in physical health problems, including poor dietary choices. Therefore, it is evident that learning is not only affected by the consistency of study habits but also by the physical well-being of the student.\nNutrition, Exercise, and Sleep\nNutrition and exercise are two critical components that influence the third factor: sleep. Proper nutrition is well-understood in its importance, but the role of exercise is multifaceted. Exercise directly benefits cognitive function by reducing insulin resistance and inflammation and stimulating the release of growth factors. Indirectly, it improves mood, sleep, and reduces stress and anxiety, all of which contribute to a healthier brain environment, particularly in the hippocampus, which is associated with verbal memory and learning (Nystoriak and Bhatnagar, 2018).\nThe Role of Sleep in Learning\nSleep is a fundamental requirement for all higher life forms and is crucial for learning. Sleep deprivation can have severe physiological consequences, affecting a student’s ability to learn effectively. The quality of sleep is intimately linked to the quality of learning, raising the question of how to optimize sleep to enhance educational outcomes.\n\nIn the following sections, we will delve into the specifics of how sleep quality can be optimized, the role of nutrition and exercise in cognitive performance, and the strategies for maintaining consistency in learning practices. We will also explore the broader implications of physical well-being on learning, including the impact of sleep on learning and how to mitigate the adverse effects of factors such as increased screen time.\nExplaining the Nature of Sleep\nSleep is a complex and essential biological process, categorized into two primary types: non-rapid eye movement (NREM) and rapid eye movement (REM) sleep (Colten et al, 2006). Understanding these stages is crucial for optimizing learning and overall well-being.\nNREM and REM Sleep\nNREM sleep consists of four stages, ranging from light to deep sleep. The sleep cycle begins with stage 1 of NREM, progressing through to the deeper stages and culminating in REM sleep. This cycle repeats several times throughout a typical night’s sleep, with REM periods becoming longer as the night progresses.\nNREM Stages\n\nStage 1: This initial stage is a transition period between wakefulness and sleep that lasts for a few minutes, making up a small percentage of the sleep cycle.\nStage 2: Occupying the largest portion of the sleep cycle, stage 2 is crucial for memory consolidation. The presence of sleep spindles, as observed in EEG patterns, is associated with the integration of new information, supporting the concept of “sleeping on a problem” (Stickgold, 2005).\nStages 3 and 4 (Slow-Wave Sleep): These stages are characterized by deep sleep, with stage 4 being the deepest, where the arousal threshold is highest.\n\nREM Sleep\nREM sleep is marked by active brain patterns, muscle atonia, and rapid eye movements. It is often associated with vivid dreaming and is also thought to play a role in memory consolidation.\nSleep Cycles and Efficiency\nThe typical monophasic sleep pattern consists of multiple 90-minute cycles. However, polyphasic sleep patterns, which involve multiple sleep phases throughout the day, have been suggested as a more efficient alternative, potentially reducing the overall need for sleep and mitigating issues like jet lag (Colten et al, 2006).\nSleep Stage Repartitioning\nThe body prioritizes REM and slow-wave sleep (SWS), with REM pressure building quickly and SWS pressure building slowly. This repartitioning ensures that the most critical stages of sleep are preserved, especially when sleep is restricted (Nade, 2022).\nCircadian Rhythms\nCircadian rhythms regulate various physiological and behavioral processes, including the sleep-wake cycle. They are influenced by two processes: the homeostatic drive for sleep (process S) and the circadian alerting system (process C). Manipulating these processes, such as by adjusting body temperature or timing of physical activity and meals, can influence sleep patterns and efficiency (Fuller et al, 2006; Crispim et al, 2007).\nThe Role of Light Sleep\nWhile deep sleep stages are crucial, light sleep stages (NREM1 and NREM2) also serve important functions, particularly in recovery from mental and physical exertion. Short naps consisting of light sleep can improve wakefulness and performance without the grogginess often associated with longer naps (Lam et al, 2011).\n\nIn summary, sleep is a multifaceted process that plays a vital role in learning and cognitive function. By understanding and optimizing the various stages of sleep, particularly through strategies like sleep stage repartitioning and aligning with circadian rhythms, one can enhance the quality of both sleep and learning. The next sections will explore how to apply this knowledge to develop effective sleep habits, including the potential benefits of polyphasic sleep and the importance of circadian rhythms in cognitive performance.\nPersonal Case Study: Self-Experimentation with Polyphasic Sleep\nTransition from Monophasic to Polyphasic Sleep\nThe shift from a monophasic sleep schedule, which is the most common pattern of sleep involving around 9 hours of continuous night-time rest, to a polyphasic sleep pattern represents a significant change in lifestyle and requires careful consideration and adaptation.\nInitial Challenges and Adaptations\nThe initial adoption of the Everyman sleep pattern, which drastically reduces night-time sleep in favor of multiple short naps, presented immediate challenges. The experience of intense sleep deprivation highlighted the body’s need for a period of adjustment and the importance of a gradual transition to alternative sleep schedules.\nSegmented Dual-Core Sleep\nSwitching to a segmented dual-core sleep pattern, which aligns more closely with historical sleep patterns, provided a more sustainable approach. This pattern, consisting of two 3-hour sleep blocks with a period of wakefulness in between, allowed for better sleep quality and the integration of a productive flow state during the early morning hours.\nCircadian Rhythm Regulation\nTo further support this new sleep schedule, strategies such as extended periods of darkness and intermittent fasting were employed to regulate the circadian rhythm. These practices not only facilitated the adjustment to the new sleep pattern but also contributed to overall well-being and cognitive function.\nImplications for Learning\nThe experience of modifying sleep patterns has implications for learning efficiency. By optimizing sleep and aligning it with the body’s natural rhythms, one can potentially enhance cognitive performance and make future learning endeavors more effective.\n\nThis personal case study underscores the potential benefits and challenges of self-experimentation with sleep patterns. It also highlights the importance of understanding one’s own body and the need for careful monitoring when making significant changes to sleep habits. The insights gained from this experiment can inform further exploration into the optimization of learning through sleep and the development of personalized strategies for enhancing cognitive performance.\nEncoding Strategies in Learning\nUnderstanding Bloom’s Taxonomy\nBloom’s Taxonomy, as illustrated in Figure 5, provides a hierarchical classification of learning objectives that educators can use to focus on higher-order thinking skills. The taxonomy emphasizes the importance of progressing beyond mere recall of facts (Forehand, 2010) to deeper levels of understanding, application, analysis, evaluation, and creation (Michael, 2006).\nThe Challenge and Reward of Higher-Order Thinking\nEngaging with the higher levels of Bloom’s Taxonomy presents an initial challenge but can lead to more significant learning outcomes. For instance, a student conducting a chemistry experiment without prior knowledge may struggle initially but will learn more deeply through the process of investigation and application.\nCognitive Load and Stress in Learning\nThe concept of cognitive load is crucial when imposing challenges on learners. The Yerkes-Dodson law suggests that while a certain amount of stress can enhance performance, too much stress can be detrimental (Broadhurst, 1959). This balance is essential when designing learning experiences that push students to higher levels of Bloom’s Taxonomy without overwhelming them.\nThe Role of Memory Functions\nHuman memory functions—encoding, storage, and retrieval—are fundamental to learning (McLeod, 2007). Encoding, or the process of transferring information into the memory system, is particularly important as it involves categorizing and connecting new information with existing knowledge, often during sleep (Stickgold, 2005).\nAutomatic vs. Effortful Processing\nEncoding can be automatic, as with the subconscious recall of time or space, or effortful, as with learning new skills like driving or algebra (Hartlage et al., 1993). Mastery of “threshold topics” requires effortful processing before they can be encoded automatically (Meyer et al., 2010).\nMethods of Encoding\nThere are three primary methods of encoding information: semantic, visual, and acoustic. Semantic encoding, which involves connecting new information to existing knowledge, has been shown to be particularly effective (Bousfield, 1935; Rice University, 2017). Visual encoding relates to imagery, and acoustic encoding is often used in learning through music or rhymes (Tierney et al., 2013).\nThe Effectiveness of Semantic Encoding\nResearch by Craik and Tulving (1975) indicates that semantic encoding is more effective than visual or acoustic encoding, likely due to the deeper level of processing involved.\nRecoding and Mnemonics\nRecoding involves converting information into a format that is easier to understand, such as through the use of mnemonics. However, this can sometimes lead to the memorization of extraneous information (Henson, 2000).\nStrategies to Enhance Retention\nPsychologists have explored various strategies to enhance retention during study, such as elaborative encoding, which involves actively connecting new themes to prior knowledge (Craik &amp; Lockhart, 1972), and creating vivid mental images (Bower &amp; Reitman, 1972).\nThe Role of Priming in Learning\nPriming is a technique where exposure to one stimulus influences the response to a subsequent stimulus, which can be used to enhance learning about a subject (Schater and Buckner, 1998). This is particularly useful when approaching threshold concepts, which, once understood, can transform a student’s perspective on a subject (Meyer et al., 2010).\n\nIn summary, the process of encoding in learning is multifaceted, involving various strategies that can enhance the retention and application of knowledge. By understanding and applying these strategies, students can navigate through the levels of Bloom’s Taxonomy more effectively, leading to deeper and more enduring learning experiences. The integration of these concepts is essential for educators and learners alike, as they strive to create learning environments that foster higher-order thinking and meaningful engagement with the material.\nConsolidation Strategies in Learning\nPurpose of Note-Taking\nNote-taking should be intentional and tailored to its purpose—whether for recording information, revision, or demonstrating engagement. Mindless copying is ineffective; notes should be crafted for their intended use.\nThe Cornell Note-Taking System\nThe Cornell System, as described by Quintus et al. (2012), is a structured method that divides a page into three sections for notes, cues, and summary. This system encourages concise note-taking and active engagement with the material through delayed note-taking, which aligns with the concept of recoding.\nMind Maps for Nonlinear Learning\nMind maps address the limitations of linear note-taking systems like Cornell by visually and immediately connecting concepts. The GRINDE acronym (Sung, 2020) encapsulates the principles of effective mind mapping, ensuring that ideas are grouped, reflective, interconnected, non-verbal, directional, and emphasized.\nOvercoming the Forgetting Curve\nThe forgetting curve illustrates the decline of memory retention over time. Regular review of material, utilizing spaced repetition, can combat this natural forgetfulness (Averell and Heathcote, 2011). The effortful retrieval involved in spaced repetition strengthens encoding.\nIdentifying Problem Areas\nThe “Paper Test” is a diagnostic tool to identify gaps in knowledge. By creating a mind map from memory, learners can pinpoint missing information and focus on threshold topics that require additional attention.\nFlashcards for Reinforcement\nFlashcards facilitate active recall and self-testing, which are crucial for memory consolidation (Kornell, 2009). The process of creating flashcards is itself a form of encoding, and using them in a spaced repetition system like the Leitner System (Byrson, 2012) can help prioritize areas that need more focus.\nThe Feynman Technique for Deep Understanding\nThe Feynman Technique, named after physicist Richard Feynman, emphasizes the importance of simplifying complex information to teach it to others. This method ensures a deep understanding of the subject matter and clarifies thought processes (Reyes et al., 2013).\n\nIn essence, consolidation in learning is about making the information stick. It’s not just about taking notes or memorizing facts; it’s about integrating and synthesizing information in a way that makes it part of your cognitive framework. By using structured note-taking systems, visual aids like mind maps, and active recall techniques, students can enhance their learning and retention. The Feynman Technique further refines this process by ensuring that understanding is deep enough to teach others in simple terms. These strategies are not just about passing exams; they’re about truly understanding and being able to apply knowledge in various contexts.\nConclusion\nIn conclusion, the interplay between physical well-being and learning efficiency cannot be overstated. Regular physical activity and a balanced diet are foundational to maintaining the cognitive functions necessary for effective learning. Time management strategies such as the Eisenhower Matrix, Pareto Principle, or Pomodoro Technique can optimize the learning process by focusing on what’s essential and managing distractions.\nUnderstanding the mechanics of memory, particularly encoding and recoding, is critical for students to effectively internalize and retain complex material. The choice of note-taking techniques, whether it be the structured Cornell method or the more visual and interconnected GRINDE approach for mind maps, should align with the individual’s learning style and the nature of the material being studied.\nSleep plays a dual role in this complex system, serving both as a critical component for memory consolidation and as a fundamental pillar of overall health. Whether one follows a monophasic or polyphasic sleep pattern, the key is consistency and alignment with one’s daily routine to ensure restorative sleep.\nUltimately, the most effective learning strategy is one that a student can consistently apply and adapt to their individual needs and circumstances. It should encompass not only the aforementioned physical and cognitive strategies but also incorporate effective priming, encoding, recoding, note-taking, and consolidation techniques.\nFurther research into the long-term effects of polyphasic sleep, especially more extreme variations, could provide valuable insights into optimizing the balance between learning, sleep, and overall well-being. Additionally, promoting awareness and understanding of concepts like priming and encoding could significantly enhance educational practices and outcomes.\nThe journey of learning is deeply personal and multifaceted, and while efficiency is desirable, it should not come at the cost of health or personal well-being. Each student must find a harmonious balance that supports both their educational ambitions and their life outside of academics.\n\nReferences\nCrimson &amp; GeneralNguyen: Polyphasic Sleep Community (2021) ‘Sleep Repartitioning’, POLYPHASIC SLEEP | Sleep Right, Live Well [Online]. Available at www.polyphasic.net/repartition/ (Accessed 23 March 2022).\nAverell, L. and Heathcote, A. (2011) ‘The form of the forgetting curve and the fate of memories’, Journal of Mathematical Psychology, Special Issue on Hierarchical Bayesian Models, vol. 55, no. 1, pp. 25–35 [Online]. DOI: 10.1016/j.jmp.2010.08.009.\nBower, G. H. and Reitman, J. S. (1972) ‘Mnemonic elaboration in multilist learning’, Journal of Verbal Learning and Verbal Behavior, vol. 11, no. 4, pp. 478–485 [Online]. DOI: 10.1016/S0022-5371(72)80030-6.\nBratterud, H., Burgess, M., Fasy, B. T., Millman, D. L., Oster, T. and Sung, E. (Christine) (2020) ‘The Sung Diagram: Revitalizing the Eisenhower Matrix’, Pietarinen, A.-V., Chapman, P., Bosveld-de Smet, L., Giardino, V., Corter, J., and Linker, S. (eds), Diagrammatic Representation and Inference, Lecture Notes in Computer Science, Cham, Springer International Publishing, pp. 498–502 [Online]. DOI: 10.1007/978-3-030-54249-8_43.\nBroadhurst, P. L. (1959) ‘The interaction of task difficulty and motivation: The Yerkes Dodson law revived’, Acta Psychologica, Amsterdam, vol. 16, pp. 321–338 [Online]. DOI: 10.1016/0001-6918(59)90105-2.\nBryan, J. F. and Locke, E. A. (1967) ‘Parkinson’s Law as a goal-setting phenomenon’, Organizational Behavior and Human Performance, vol. 2, no. 3, pp. 258–275 [Online]. DOI: 10.1016/0030-5073(67)90021-9.\nBryson, D. (2012) ‘Using Flashcards to Support Your Learning’, Journal of Visual Communication in Medicine, Taylor &amp; Francis, vol. 35, no. 1, pp. 25–29 [Online]. DOI: 10.3109/17453054.2012.655720.\nBuchanan, C. (2012) The 15 Minute Rule: How to stop procrastinating and take charge of your life, Hachette UK.\nChaput, J.-P., Dutil, C., Featherstone, R., Ross, R., Giangregorio, L., Saunders, T. J., Janssen, I., Poitras, V. J., Kho, M. E., Ross-White, A., Zankar, S. and Carrier, J. (2020) ‘Sleep timing, sleep consistency, and health in adults: a systematic review’, Applied Physiology, Nutrition, and Metabolism, NRC Research Press, vol. 45, no. 10 (Suppl. 2), pp. S232–S247 [Online]. DOI: 10.1139/apnm-2020-0032.\nChaturvedi, K., Vishwakarma, D. K. and Singh, N. (2021) ‘COVID-19 and its impact on education, social life and mental health of students: A survey’, Children and Youth Services Review, vol. 121, p. 105866 [Online]. DOI: 10.1016/j.childyouth.2020.105866.\nChau, F.-W. (2017) How to read more by using Pomodoro Technique [Online]. Available at chaurocks.com/read-more-using-pomodoro-technique/ (Accessed 23 March 2022).\nCirillo, F. (2007) ‘The Pomodoro Technique (The Pomodoro)’, p. 45.\nColten, H. R., Altevogt, B. M. and Research, I. of M. (US) C. on S. M. and (2006) Sleep Physiology, Sleep Disorders and Sleep Deprivation: An Unmet Public Health Problem, National Academies Press (US) [Online]. Available at www.ncbi.nlm.nih.gov/books/NBK19956/ (Accessed 23 March 2022).\nCraik, F. I. M. and Lockhart, R. S. (1972) ‘Levels of processing: A framework for memory research’, Journal of Verbal Learning and Verbal Behavior, vol. 11, no. 6, pp. 671–684 [Online]. DOI: 10.1016/S0022-5371(72)80001-X.\nCraik, F. I. M. and Tulving, E. (1975) ‘Depth of processing and the retention of words in episodic memory’, Journal of Experimental Psychology: General, US, American Psychological Association, vol. 104, no. 3, pp. 268–294 [Online]. DOI: 10.1037/0096-3445.104.3.268.\nCrispim, C. A., Zalcman, I., Dáttilo, M., Padilha, H. G., Edwards, B., Waterhouse, J., Tufik, S. and Mello, M. T. de (2007) ‘The influence of sleep and sleep loss upon food intake and metabolism’, Nutrition Research Reviews, Cambridge University Press, vol. 20, no. 2, pp. 195–212 [Online]. DOI: 10.1017/S0954422407810651.\nDunford, R., Su, Q. and Tamang, E. (2014) ‘The Pareto Principle’, University of Plymouth [Online]. Available at pearl.plymouth.ac.uk/handle/10026.1/14054 (Accessed 23 March 2022).\nEkirch, A. R. (2016) ‘Segmented Sleep in Preindustrial Societies’, Sleep, vol. 39, no. 3, pp. 715–716 [Online]. DOI: 10.5665/sleep.5558.\nFarnam Street (2018) The Spacing Effect: How to Improve Learning and Maximize Retention [Online]. Available at fs.blog/spacing-effect/ (Accessed 23 March 2022).\nForehand, M. (2011) ‘Bloom’s Taxonomy’, The University of Georgia.\nFuller, P. M., Gooley, J. J. and Saper, C. B. (2006) ‘Neurobiology of the Sleep-Wake Cycle: Sleep Architecture, Circadian Regulation, and Regulatory Feedback’, Journal of Biological Rhythms, SAGE Publications Inc, vol. 21, no. 6, pp. 482–493 [Online]. DOI: 10.1177/0748730406294627.\nHartlage, S., Alloy, L. B., Vázquez, C. and Dykman, B. (1993) ‘Automatic and effortful processing in depression’, Psychological Bulletin, US, American Psychological Association, vol. 113, no. 2, pp. 247–278 [Online]. DOI: 10.1037/0033-2909.113.2.247.\nHenson, R. N. A., Burgess, N. and Frith, C. D. (2000) ‘Recoding, storage, rehearsal and grouping in verbal short-term memory: an fMRI study’, Neuropsychologia, vol. 38, no. 4, pp. 426–440 [Online]. DOI: 10.1016/S0028-3932(99)00098-6.\nhow I studied for 12 hours a day for over a year (2021) Directed by James Scholz [Film].\nThe Perfect Mindmap: 6 Step Checklist (2020) Directed by Justin Sung [Film].\nKane, L. (2014) 9 things rich people do and don’t do every day [Online]. Available at www.businessinsider.com/rich-people-daily-habits-2014-6 (Accessed 23 March 2022).\nKornell, N. (2009) ‘Optimising learning using flashcards: Spacing is more effective than cramming’, Applied Cognitive Psychology, vol. 23, no. 9, pp. 1297–1317 [Online]. DOI: 10.1002/acp.1537.\nKos, B. (2021) The Eisenhower matrix – A popular prioritization framework | Spica [Online]. Available at www.spica.com/blog/the-eisenhower-matrix (Accessed 23 March 2022).\nKühnel, J., Zacher, H., de Bloom, J. and Bledow, R. (2017) ‘Take a break! Benefits of sleep and short breaks for daily work engagement’, European Journal of Work and Organizational Psychology, Routledge, vol. 26, no. 4, pp. 481–491 [Online]. DOI: 10.1080/1359432X.2016.1269750.\nLam, J. C., Mahone, E. M., Mason, T. B. A. and Scharf, S. M. (2011) ‘The Effects of Napping on Cognitive Function in Preschoolers’, Journal of developmental and behavioral pediatrics : JDBP, vol. 32, no. 2, pp. 90–97 [Online]. DOI: 10.1097/DBP.0b013e318207ecc7.\nMacan, T. H., Shahani, C., Dipboye, R. L. and Phillips, A. P. (1990) ‘College students’ time management: Correlations with academic performance and stress’, Journal of Educational Psychology, US, American Psychological Association, vol. 82, no. 4, pp. 760–768 [Online]. DOI: 10.1037/0022-0663.82.4.760.\nMaquet, P. (2001) ‘The Role of Sleep in Learning and Memory’, Science, American Association for the Advancement of Science, vol. 294, no. 5544, pp. 1048–1052 [Online]. DOI: 10.1126/science.1062856.\nMcLeod, S. A. (2007) ‘[Stages of memory-encoding storage and retrieval]’, [Online]. Available at www.simplypsychology.org/memory.html (Accessed 23 March 2022).\nMeyer, J. H. F., Land, R. and Baillie, C. (2010) Threshold Concepts and Transformational Learning, BRILL [Online]. DOI: 10.1163/9789460912078 (Accessed 23 March 2022).\nMichael, J. (2006) ‘Where’s the evidence that active learning works?’, Advances in Physiology Education, American Physiological Society, vol. 30, no. 4, pp. 159–167 [Online]. DOI: 10.1152/advan.00053.2006.\nMonk-Turner, E. (2003) ‘The benefits of meditation: experimental findings’, The Social Science Journal, vol. 40, no. 3, pp. 465–470 [Online]. DOI: 10.1016/S0362-3319(03)00043-0.\nNade (2022) Sleep Stage Repartitioning [Online]. Available at www.mattressnerd.com/polyphasic-sleep/science/repartitioning/ (Accessed 23 March 2022).\nNystoriak, M. A. and Bhatnagar, A. (2018) ‘Cardiovascular Effects and Benefits of Exercise’, Frontiers in Cardiovascular Medicine, vol. 5 [Online]. Available at www.frontiersin.org/article/10.3389/fcvm.2018.00135 (Accessed 23 March 2022).\nOkanovic, D. (2021) The quick guide to Bloom’s taxonomy for teachers [Online]. Available at www.bibguru.com/blog/blooms-taxonomy/ (Accessed 23 March 2022).\nOswald, T. K., Rumbold, A. R., Kedzior, S. G. E. and Moore, V. M. (2020) ‘Psychological impacts of “screen time” and “green time” for children and adolescents: A systematic scoping review’, PLOS ONE, Public Library of Science, vol. 15, no. 9, p. e0237725 [Online]. DOI: 10.1371/journal.pone.0237725.\nPepper, C. (2010) ‘“There’s a lot of learning going on but NOT much teaching!”: student perceptions of Problem‐Based Learning in science’, Higher Education Research &amp; Development, vol. 29, no. 6, pp. 693–707 [Online]. DOI: 10.1080/07294360.2010.501073.\nQuintus, L., Borr, M., Duffield, S., Napoleon, L. and Welch, A. (2012) ‘The Impact of the Cornell Note-Taking Method on Students’ Performance in a High School Family and Consumer Sciences Class’, p. 13.\nRead-Bivens (2016) ‘Abandoning Pomodoros, Part One: The Pros and Cons of Pomos’, Medium [Online]. Available at medium.com/@UrgentPigeon/abandoning-pomodoros-part-one-the-pros-and-cons-of-pomos-e3f3e9342ac9 (Accessed 23 March 2022).\nReyes, E. P., Blanco, R. M. F. L., Doroon, D. R. L., Limana, J. L. B. and Torcende, A. M. A. (2021) ‘Feynman Technique as a Heutagogical Learning Strategy for Independent and Remote Learning’, Recoletos Multidisciplinary Research Journal, vol. 9, no. 2, pp. 1–13 [Online]. DOI: 10.32871/rmrj2109.02.06.\nSchacter, D. L. and Buckner, R. L. (1998) ‘Priming and the Brain’, Neuron, vol. 20, no. 2, pp. 185–195 [Online]. DOI: 10.1016/S0896-6273(00)80448-1.\nScharf, M. (2017) ‘My New Goal: Follow Ben Franklin’s Rule to Set Aside 1 Hour a Day to Learn’, UCF Forum [Online]. Available at stars.library.ucf.edu/ucf-forum/238.\nSimmons, M. (2018) Why Constant Learners All Embrace the 5-Hour Rule - Michael D. Simmons [Online]. Available at michaeldsimmons.com/why-constant-learners-all-embrace-the-5-hour-rule-mm09/ (Accessed 23 March 2022).\nSteriade, M. (2004) ‘Acetylcholine systems and rhythmic activities during the waking–sleep cycle’, in Progress in Brain Research, Acetylcholine in the Cerebral Cortex, Elsevier, vol. 145, pp. 179–196 [Online]. DOI: 10.1016/S0079-6123(03)45013-9 (Accessed 23 March 2022).\nStickgold, R. (2005) ‘Sleep-dependent memory consolidation’, Nature, vol. 437, no. 7063, pp. 1272–1278 [Online]. DOI: 10.1038/nature04286.\nSweller, J. (1994) ‘Cognitive load theory, learning difficulty, and instructional design’, Learning and Instruction, vol. 4, no. 4, pp. 295–312 [Online]. DOI: 10.1016/0959-4752(94)90003-5.\nTierney, A., Krizman, J., Skoe, E., Johnston, K. and Kraus, N. (2013) ‘High school music classes enhance the neural processing of speech’, Frontiers in Psychology, vol. 4 [Online]. Available at www.frontiersin.org/article/10.3389/fpsyg.2013.00855 (Accessed 23 March 2022).\nUniversity, R. (2017) ‘Memory’, [Online]. Available at lidtfoundations.pressbooks.com/chapter/memory/ (Accessed 23 March 2022).\nVotruba, T. (2012) ‘Psychological outcomes of polyphasic sleep’, Masarykova univerzita, Fakulta sociálních studií [Online]. Available at is.muni.cz/th/363896/fss_b/tomas-votruba-psychological-impacts-of-polyphasic-sleep.pdf (Accessed 23 March 2022).\nWang, Y., Xiao, H., Zhang, X. and Wang, L. (2020) ‘The Role of Active Coping in the Relationship Between Learning Burnout and Sleep Quality Among College Students in China’, Frontiers in Psychology, vol. 11 [Online]. Available at www.frontiersin.org/article/10.3389/fpsyg.2020.00647 (Accessed 23 March 2022).\nWeiland, A. and Kingsbury, S. J. (1979) ‘Immediate and Delayed Recall of Lecture Material as a Function of Note Taking’, The Journal of Educational Research, Routledge, vol. 72, no. 4, pp. 228–230 [Online]. DOI: 10.1080/00220671.1979.10885160.\nWilson, K. and Korn, J. H. (2007) ‘Attention during Lectures: Beyond Ten Minutes’, Teaching of Psychology, SAGE Publications Inc, vol. 34, no. 2, pp. 85–89 [Online]. DOI: 10.1080/00986280701291291.\nZhu, Q. and Xiang, H. (2016) ‘Differences of Pareto principle performance in e-resource download distribution: An empirical study’, The Electronic Library, Emerald Group Publishing Limited, vol. 34, no. 5, pp. 846–855 [Online]. DOI: 10.1108/EL-05-2015-0068."},"Organised/Photography/Photography":{"title":"Photography","links":["tags/photography","tags/","tags/todo"],"tags":["photography","index","todo"],"content":"photographyindextodo\nFilm photography, exposure, framing, my photos, etc.?"},"Organised/Programming/Programming":{"title":"Programming","links":["tags/programming","tags/","tags/todo"],"tags":["programming","index","todo"],"content":"programmingindextodo\nPortfolio?"},"Organised/Programming/Python/NumPy-Docstrings":{"title":"NumPy Docstrings","links":["tags/programming","tags/python","tags/docstrings","tags/todo","tags/blankslate"],"tags":["programming","python","docstrings","todo","blankslate"],"content":"programmingpythondocstringstodoblankslate"},"Organised/Programming/Python/Program-Structure":{"title":"Program Structure","links":["tags/programming","tags/python","tags/todo","tags/blankslate"],"tags":["programming","python","todo","blankslate"],"content":"programmingpythontodoblankslate"},"Organised/Programming/Python/Python":{"title":"Python","links":["tags/programming","tags/","tags/python","tags/todo"],"tags":["programming","index","python","todo"],"content":"programmingindexpythontodo\nid: 6ecf9856-7bb0-4757-b363-1875f9396880\nfolderPath: &quot;&quot;\ntitle: &quot;{{folderName}} overview&quot;\nshowTitle: false\ndepth: 10\nincludeTypes:\n  - folder\n  - markdown\nstyle: list\ndisableFileTag: false\nsortBy: name\nsortByAsc: true\nshowEmptyFolders: true\nonlyIncludeSubfolders: false\nstoreFolderCondition: true\nshowFolderNotes: true\ndisableCollapseIcon: true"},"Organised/Recipes/Recipes":{"title":"Recipes","links":["tags/cooking","tags/","tags/todo"],"tags":["cooking","index","todo"],"content":"cookingindextodo\nid: b728a0c8-aac4-4dab-9535-91c8b9e5690c\nfolderPath: &quot;&quot;\ntitle: &quot;{{folderName}} overview&quot;\nshowTitle: false\ndepth: 10\nincludeTypes:\n  - folder\n  - markdown\nstyle: list\ndisableFileTag: false\nsortBy: name\nsortByAsc: true\nshowEmptyFolders: true\nonlyIncludeSubfolders: false\nstoreFolderCondition: true\nshowFolderNotes: true\ndisableCollapseIcon: true\nname Create note from template\ntype command\naction Templater: Create new note from template\ncolor default"},"Unorganised/Angular-Commit-Format-Cheat-Sheet":{"title":"Angular Commit Format Cheat Sheet","links":["packages/compiler-cli/ngcc/README","devtools/README"],"tags":[],"content":" Commit Message Format\nThis specification is inspired by and supersedes the [AngularJS commit message format][commit-message-format].\nWe have very precise rules over how our Git commit messages must be formatted.\nThis format leads to easier to read commit history.\nEach commit message consists of a header, a body, and a footer.\n&lt;header&gt;\n&lt;BLANK LINE&gt;\n&lt;body&gt;\n&lt;BLANK LINE&gt;\n&lt;footer&gt;\n\nThe header is mandatory and must conform to the Commit Message Header format.\nThe body is mandatory for all commits except for those of type “docs”.\nWhen the body is present it must be at least 20 characters long and must conform to the Commit Message Body format.\nThe footer is optional. The Commit Message Footer format describes what the footer is used for and the structure it must have.\nCommit Message Header\n&lt;type&gt;(&lt;scope&gt;): &lt;short summary&gt;\n  │       │             │\n  │       │             └─⫸ Summary in present tense. Not capitalized. No period at the end.\n  │       │\n  │       └─⫸ Commit Scope: animations|bazel|benchpress|common|compiler|compiler-cli|core|\n  │                          elements|forms|http|language-service|localize|platform-browser|\n  │                          platform-browser-dynamic|platform-server|router|service-worker|\n  │                          upgrade|zone.js|packaging|changelog|docs-infra|migrations|ngcc|ve|\n  │                          devtools\n  │\n  └─⫸ Commit Type: build|ci|docs|feat|fix|perf|refactor|test\n\nThe &lt;type&gt; and &lt;summary&gt; fields are mandatory, the (&lt;scope&gt;) field is optional.\nType\nMust be one of the following:\n\nbuild: Changes that affect the build system or external dependencies (example scopes: gulp, broccoli, npm)\nci: Changes to our CI configuration files and scripts (examples: CircleCi, SauceLabs)\ndocs: Documentation only changes\nfeat: A new feature\nfix: A bug fix\nperf: A code change that improves performance\nrefactor: A code change that neither fixes a bug nor adds a feature\ntest: Adding missing tests or correcting existing tests\n\nScope\nThe scope should be the name of the npm package affected (as perceived by the person reading the changelog generated from commit messages).\nThe following is the list of supported scopes:\n\nanimations\nbazel\nbenchpress\ncommon\ncompiler\ncompiler-cli\ncore\nelements\nforms\nhttp\nlanguage-service\nlocalize\nplatform-browser\nplatform-browser-dynamic\nplatform-server\nrouter\nservice-worker\nupgrade\nzone.js\n\nThere are currently a few exceptions to the “use package name” rule:\n\n\npackaging: used for changes that change the npm package layout in all of our packages, e.g. public path changes, package.json changes done to all packages, d.ts file/format changes, changes to bundles, etc.\n\n\nchangelog: used for updating the release notes in CHANGELOG.md\n\n\ndev-infra: used for dev-infra related changes within the directories /scripts and /tools\n\n\ndocs-infra: used for docs-app (angular.io) related changes within the /aio directory of the repo\n\n\nmigrations: used for changes to the ng update migrations.\n\n\nngcc: used for changes to the Angular Compatibility Compiler\n\n\nve: used for changes specific to ViewEngine (legacy compiler/renderer).\n\n\ndevtools: used for changes in the browser extension.\n\n\nnone/empty string: useful for test and refactor changes that are done across all packages (e.g. test: add missing unit tests) and for docs changes that are not related to a specific package (e.g. docs: fix typo in tutorial).\n\n\nSummary\nUse the summary field to provide a succinct description of the change:\n\nuse the imperative, present tense: “change” not “changed” nor “changes”\ndon’t capitalize the first letter\nno dot (.) at the end\n\nCommit Message Body\nJust as in the summary, use the imperative, present tense: “fix” not “fixed” nor “fixes”.\nExplain the motivation for the change in the commit message body. This commit message should explain why you are making the change.\nYou can include a comparison of the previous behavior with the new behavior in order to illustrate the impact of the change.\nCommit Message Footer\nThe footer can contain information about breaking changes and deprecations and is also the place to reference GitHub issues, Jira tickets, and other PRs that this commit closes or is related to.\nFor example:\nBREAKING CHANGE: &lt;breaking change summary&gt;\n&lt;BLANK LINE&gt;\n&lt;breaking change description + migration instructions&gt;\n&lt;BLANK LINE&gt;\n&lt;BLANK LINE&gt;\nFixes #&lt;issue number&gt;\n\nor\nDEPRECATED: &lt;what is deprecated&gt;\n&lt;BLANK LINE&gt;\n&lt;deprecation description + recommended update path&gt;\n&lt;BLANK LINE&gt;\n&lt;BLANK LINE&gt;\nCloses #&lt;pr number&gt;\n\nBreaking Change section should start with the phrase “BREAKING CHANGE: ” followed by a summary of the breaking change, a blank line, and a detailed description of the breaking change that also includes migration instructions.\nSimilarly, a Deprecation section should start with “DEPRECATED: ” followed by a short description of what is deprecated, a blank line, and a detailed description of the deprecation that also mentions the recommended update path.\nRevert commits\nIf the commit reverts a previous commit, it should begin with revert: , followed by the header of the reverted commit.\nThe content of the commit message body should contain:\n\ninformation about the SHA of the commit being reverted in the following format: This reverts commit &lt;SHA&gt;,\na clear description of the reason for reverting the commit message.\n"},"Unorganised/Brother-CV":{"title":"Brother CV","links":[],"tags":[],"content":"cv\nAlexander Fayers\nSecurity-focused software engineer based in England\n\nSecurity Cleared\nExperienced Software Developer\nFirst Class Cyber Security Degree\nOpen to relocation\n\ncensored / Website / LinkedIn / GitHub\n\nDevelopment Experience\nSoftware Development Engineer @ Wavenet (Mar 2024 - Present)\nContinuing my previous role after Falanx Cyber was acquired by Wavenet, while also taking on new responsibilities as part of a larger engineering team. The overall performance and efficiency of operation teams increased on average ~3x during this time, attributed to changes applied (based on ticket throughput and reduced error rates).\n\nDue to an increase in customers and a requirement for faster report generation speeds, upgrade of reporting system to allow for several queries/reports to be executed/generated asynchronously, cutting total daily report generation time from 1 hour to 20 minutes.\nAfter introduction of new ticketing system post acquisition, given sole responsibility for integration of new ticketing system into all API-based alerting scripts.\nDesign and implementation of new Microsoft Sentinel alert definition management system using multiple GitHub repo forks to reduce duplicated rule logic in cases where customer-specific tuning is needed, providing more flexibility within rule definitions.\nGiven oversight of new Wavenet company-wide Customer Portal due to experience with Falanx Reporting Portal.\nCreation of fullstack Asset Management system used for tracking onboarded customer devices, leading to more automation opportunities and a faster onboarding workflow. Created using FastAPI and React.\n\nTechnologies used: Python, GitHub, React, FastAPI\nSoftware Development Engineer @ Falanx Cyber (Aug 2022 - Mar 2024)\nMain point of contact for all in-house software development. During this time, I defined the standards for development work within Falanx and led several initiatives towards modern practices such as CI/CD and the use of sprints.\n\nAdvocation for and implementation of automated testing and CI/CD pipelines (using CodeBuild, CodePipeline) for multiple internal projects, increasing deployment speed and lowering rate of bugs and issues.\nCreation of ACM (Access Control Matrix) tool, used to track employee account access and privilege. Created from ground up using Flask, SQLAlchemy, Alembic, and WTForms with a dynamically generated frontend based on SQLAlchemy models, using Pytest to handle testing of the project.\nManagement and upgrade of Continuous Vulnerability Scanning (CVS) system, using Nessus to scan target IPs regularly and generate a PDF report based on the scan results. Before upgrade, system would require manual intervention almost daily. Post upgrade, system has not required any intervention.\nRelease and maintenance of Reporting Portal system using Laravel for backend and React for frontend, used by customers to receive and view reports. Portal saves employees hours daily by automating notification emails for new customer reports.\n\nTechnologies used: Python, BeautifulSoup, pre-commit, CodeBuild, CodePipeline, Git, Flask, SQLAlchemy, WTForms, Alembic, Pytest, PHP, Laravel\nSOC Software Engineer @ Falanx Cyber (Sept 2021 - Aug 2022)\nPart-time maintenance and extensions of systems during final year of university.\n\nMaintained and iterated upon the main Triarii reporting system used to provide key insight to all customers using the service.\nDeveloped f:CEL, an automated cyber risk report assessment system, in two-weeks prior to starting final year at university and accepting part-time role at Falanx.\n\nTechnologies used: Python, BeautifulSoup, WeasyPrint, HTML, CSS, Git\nSOC Engineer @ Falanx Cyber (Feb 2021 - Sept 2021)\nTechnical onboarding of new customers and experience within the technical side of SOC operations.\n\nLinux server management (Bash scripting, Python automation, general service management).\nAWS - EC2, S3, IAM configuration.\nElasticsearch pipeline configuration and query optimisation through Kibana.\nAdjusted client endpoint onboarding script using C#.NET and S3 for remote configuration.\n\nTechnologies used: Python, Elasticsearch, Kibana, AWS (EC2, S3, CodeCommit, etc.), C#.NET, Bash, general Linux usage, Git\nSOC Analyst @ Falanx Cyber (Sept 2020 - Feb 2021)\nHandling of customer tickets, explanation of events to customers, and general automation of daily tasks to increase efficiency of service delivery.\n\nCreated ‘SentiNull’, a replacement for the poor notification system for tickets.\nCreated ‘Mail Stripper’, phishing email analysis system (later recreated as part of final year development project at university).\nUsed Kibana and Elasticsearch to query data, threat hunt, and gain insight into large scale data.\n\nTechnologies used: Python, Elasticsearch, Bash, general Linux usage, Git\n\nAccomplishments\nSecond Place Individually @ RoboCup CoSpace World Finals (2015)\nImplemented a new approach to the problem of simulated rescue by using a “waypoints” system to intelligently guide the robot rather than blindly roaming. Placed 2nd in the technical programming challenge in the world finals in China, and 4th overall with team.\nFinal Year Development Project - “Mail Stripper” @ De Montfort University (2021 - 2022)\nA framework for enabling fully automated email analysis, targeted toward business environments such as security service providers. The system allows analysis modules to be simply and rapidly prototyped, tested, and deployed, with a core focus on reduction of ‘undifferentiated heavy lifting’ (common manual work).\nTechnologies used: Docker, Python, Celery, Redis, MySQL, Flask\nSimply Budget (2020)\nCreated a simple React Native (Expo) app which is now available on the Play Store, due to issues encountered with existing solutions and to learn more about mobile development.\nTechnologies used: Expo, JavaScript, React Native\nHackTheBox - Elite Hacker\nWith free time, occasionally enjoy CTF on HackTheBox, and have been awarded the rank of “Elite Hacker”.\n\nEducation\nDe Montfort University - Leicester, England (2019 - 2022)\nBachelor of Science (Honours) with Placement in Cyber Security: First Class\nCounty Upper School - censored, England (2016 - 2018)\nA Levels: Computer science, Mathematics, Physics, Further Maths (AS)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSubjectGradeComputer ScienceBMathematicsDPhysicsDFurther Maths (AS)C\nGCSES\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSubjectGradeComputingAFrenchAGraphic ProductsAMathematicsAPhysicsAFour other subjectsBThree other subjectsC\n\nCounty Upper School - censored, England (2013 - 2016)\n"},"Unorganised/Convenience-Store-Challenge":{"title":"Convenience Store Challenge","links":["tags/"],"tags":[""],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Convenience StoreGiven a total due and an array representing the amount of change in your pocket, determine whether or not you are able to pay for the item.Change will always be represented in the following order: quarters, dimes, nickels, pennies.Example: changeEnough([25, 20, 5, 0], 4.25) return true because:25 quarters, 20 dimes, 5 nickels and 0 pennies gives you 6.25 + 2 + .25 + 0 = 8.50.This means you can afford the item, so return true. Examples&lt;br&gt;changeEnough([2, 100, 0, 0], 14.11) ➞ false&lt;br&gt;&lt;br&gt;changeEnough([0, 0, 20, 5], 0.75) ➞ true&lt;br&gt;&lt;br&gt;changeEnough([30, 40, 20, 5], 12.55) ➞ true&lt;br&gt;&lt;br&gt;changeEnough([10, 0, 0, 50], 3.85) ➞ false&lt;br&gt;&lt;br&gt;changeEnough([1, 0, 5, 219], 19.99) ➞ false&lt;br&gt; Notes- quarter = 25 cents / 0.25&lt;br&gt;    &lt;br&gt;- **dime**= 10 cents / 0.10    - nickel = 5 cents / 0.05&lt;br&gt;    &lt;br&gt;- **penny** = 1 cent / 0.01"},"Unorganised/DVSA-Theory-Test-Results-Review-(Maicey)":{"title":"DVSA Theory Test Results Review (Maicey)","links":[],"tags":[],"content":"Multiple Choice Breakdown\n\n1. Road and Traffic Signs (6 marks needed)\nUnderstanding road signs is crucial for safe driving. This includes recognizing regulatory signs, warning signs, and information signs.\nAn example question would be something like…\nQ: What does a triangular sign with a red border indicate?\nA: It indicates a warning of a potential hazard ahead.\n\n\n\n                  \n                  By the way \n                  \n                \n\nThis is definitely the biggest category! I recommend focusing on this one to start, since it’s also the one you lost the most marks on :))\n\n\nFlashcards / Video / Test\n\n2. Safety and Your Vehicle (4 marks needed)\nMaintaining your vehicle’s safety is essential. This includes regular checks on tire pressure, oil levels, and lighting systems.\nAn example question would be something like…\nQ: What should you verify before embarking on a long trip?\nA: Confirm that the tires are adequately inflated, oil levels are sufficient, and all lights are operational.\n\nNotes &amp; Test\n\n3. Maintaining Safety Margins (2 marks needed)\nSafety margins involve keeping a safe distance from other vehicles and obstacles to ensure you can stop or manœuvrer safely.\nAn example question would be something like…\nQ: What is the advised stopping distance at 60 mph on a dry road?\nA: The stopping distance is roughly 73 meters (240 feet).\n\n\n\n                  \n                  NOTE\n                  \n                \n\nI really don’t like this category as it’s remembering a bunch of numbers… Practice it lots!\n\n\nNotes &amp; Test\n\n4. Awareness of Vulnerable Road Users (1 mark needed)\nUnderstanding the needs of pedestrians, cyclists, and motorcyclists is vital for safe interactions on the road.\nAn example question would be something like…\nQ: What should you do when you notice a cyclist signaling to turn left?\nA: Be ready to give them space and avoid overtaking if it poses a risk.\n\nNotes &amp; Test\n\n5. Required Driving Documents (1 mark needed)\nFamiliarity with essential driving documents, such as insurance, driving license, and MOT certificate, is crucial.\nAn example question would be something like…\nQ: Which document must you have while driving?\nA: A valid driving license.\n\nNotes &amp; Test\n\n6. Understanding Other Vehicle Types (1 mark needed)\nRecognizing the characteristics and limitations of various vehicle types, including buses, trucks, and motorcycles, is important for safe driving.\nAn example question would be something like…\nQ: What should you keep in mind when driving near a large vehicle?\nA: Large vehicles have bigger blind spots and may require more time to stop.\n\nNotes &amp; Test\n\n7. Motorway Regulations (1 mark needed)\nBeing aware of specific rules and regulations that govern motorway driving is essential for safety.\nAn example question would be something like…\nQ: What is the maximum speed limit for cars on a motorway?\nA: The maximum speed limit is 70 mph.\n\nNotes &amp; Test\n\n8. Staying Alert (1 mark needed)\nRecognizing the importance of alertness and being aware of signs of fatigue or distraction is crucial for safe driving.\nAn example question would be something like…\nQ: What should you do if you start feeling drowsy while driving?\nA: Safely pull over and take a break.\n\nNotes &amp; Test\n\n9. Hazard Awareness (1 mark needed)\nIdentifying potential hazards on the road and knowing how to respond is key to safe driving.\nAn example question would be something like…\nQ: What is a potential hazard when driving in wet conditions?\nA: Reduced visibility and increased stopping distances.\n\nNotes &amp; Test\n\nPractice Schedule\n\nWeek 1: Focus on Multiple Choice\n\nDay 1-2: Road and Traffic Signs (30 minutes each day)\nDay 3-4: Safety and Your Vehicle (30 minutes each day)\nDay 5: Safety Margins (30 minutes)\nDay 6: Vulnerable Road Users and Documents (30 minutes)\nDay 7: Review all topics (1 hour)\n\n\nWeek 2: Focus on Hazard Perception\nMock Tests\n\nDay 1-2: Watch and practice hazard perception clips (30 minutes each day)\nDay 3: Focus on double hazards (30 minutes)\nDay 4-5: Review clips that scored low (30 minutes each day)\nDay 6: Take a full mock test (1 hour)\nDay 7: Review results and focus on weak areas (1 hour)\n\n\nWeek 3: Full Revision\nMock Tests\n\nDay 1-3: Review all multiple-choice topics (30 minutes each day)\nDay 4-5: Review hazard perception clips (30 minutes each day)\nDay 6: Take another full mock test (1 hour)\nDay 7: Final review :)\n"},"Unorganised/Definition-of-Distance-Theorem":{"title":"Definition of Distance Theorem","links":["Unorganised/Definition-of-Minimum-Code-Distance"],"tags":[],"content":"Let C be a code with minimal distance d_{\\text{min}}(C). Then the following statements hold:\n\nIf t\\in \\mathbb{N} and d_{\\text{min}}(C)\\ge t+1, then C detects t errors.\nIf k\\in \\mathbb{N} and d_{\\text{min}}(C)\\ge 2k+1, then C corrects k errors.\n\nNote: this means that geometric information about a code can inform you on its error detection and correction ability!"},"Unorganised/Definition-of-Error-Correction":{"title":"Definition of Error Correction","links":[],"tags":[],"content":"We say that C corrects k errors if, whenever up to k errors occur in the transmission of any codeword (and these errors are detected), then we can reconstruct the correct codeword sent by using the other symbols sent correctly and the definition of the code C."},"Unorganised/Definition-of-Error-Detection":{"title":"Definition of Error Detection","links":[],"tags":[],"content":"We say that a code C detects t errors if, whenever up to t errors occur in the transmission of any codeword, then we receive an invalid codeword (that is, we know from C that the transmission was faulty)."},"Unorganised/Definition-of-Hamming-Distance":{"title":"Definition of Hamming Distance","links":[],"tags":[],"content":"Given a q-ary alphabet A=\\set{a_{1},a_{2},\\ldots,a_{i}}, the Hamming distance d(w_{1}, w_{2}) between two words w_{1}, w_{2} \\in A^{n} is the total number of positions in which w_{1} has a different symbol than w_{2}.\nRewriting with mathematical symbols, that means:\nd(w_{1},w_{2}):=|\\set{i\\in \\set{1,2,\\ldots,n}:x_{i}\\ne y_{i}}|,\\text{ where}\n\\begin{cases}\nw_{1}=(x_{1},x_{2},\\ldots,x_{i})\\in A^{n}\\\\\nw_{2}=(y_{1},y_{2},\\ldots,y_{i})\\in A^{n}\n\\end{cases}"},"Unorganised/Definition-of-Metric-Spaces-and-Distance-Functions":{"title":"Definition of Metric Spaces and Distance Functions","links":[],"tags":[],"content":"Let S be a set. We say that S forms a metric space if there exists a function d:S\\times S\\to \\mathbb{R}_{\\ge0}, called a metric or distance function, which satisfies the following axioms:\n\nNon-Negativity: Given x,y\\in S, d(x,y)=0\\iff x=y, i.e. two points are zero distance apart, only if they are the same point.\nSymmetry: For all x,y\\in S, d(x,y)=d(y,x), i.e. it doesn’t matter which direction you measure the distance between two points, it should result in the same distance.\nTriangle Inequality: For all x,y,z\\in S, d(x,z)\\le d(x,y)+d(y,z), i.e. the direct distance between two points is always less than the indirect route.\n\nInformally, a space with the concept of measuring distance."},"Unorganised/Definition-of-Minimum-Code-Distance":{"title":"Definition of Minimum Code Distance","links":[],"tags":[],"content":"Let C be a code and d its Hamming distance function. The (minimum) distance of C, denoted by d_{\\text{min}}(C), is the smallest Hamming distance possible achieved by two (distinct) codewords of C.\nMathematically,\nd_{\\text{min}}(C):=\\text{min}\\set{d(c_{1},c_{2}):c_{1},c_{2}\\in C,c_{1}\\ne c_{2}}"},"Unorganised/Definition-of-Nearest-Neighbour-Decoding":{"title":"Definition of Nearest Neighbour Decoding","links":[],"tags":[],"content":"Given a code C\\subset A^{n} over an alphabet A and a word w\\in A^{n}, a (valid) codeword c\\in C is called a nearest neighbour codeword to w if\nd(c,w)=\\text{min}\\set{d(w,x):x\\in C}\nThe nearest neighbour decoding strategy is the strategy of choosing a nearest neighbour codeword to a word received (possibly in error) in a transmission.\nNote: there may be more than one nearest neighbour codeword!"},"Unorganised/Definition-of-a-Cartesian-Product-in-Coding-Theory":{"title":"Definition of a Cartesian Product in Coding Theory","links":[],"tags":[],"content":"Given a finite set A with q elements, the Cartesian product is the set of all ordered pairs that can be formed by taking one element from each of the sets involved in the product."},"Unorganised/Definition-of-a-Code-in-Coding-Theory":{"title":"Definition of a Code in Coding Theory","links":[],"tags":[],"content":"Given n \\in N, a finite sequence x_{1},x_{2},\\ldots,x_{i} with every x_{i} belonging to the alphabet A is called a word (or vector or message) of length n over A. Such a word can also be viewed as an element (x_{1},x_{2},\\ldots,x_{i})\\in A^{n}. A q-ary code (over A) of length n is just a subset C\\subset A^{n}. A (valid) codeword is an element of C."},"Unorganised/Definition-of-a-Solid-Sphere":{"title":"Definition of a Solid Sphere","links":[],"tags":[],"content":"Given a metric space X with distance function d and a positive real number \\epsilon\\in \\mathbb{R}_{\\gt0}, the solid sphere (or ball) or radius \\epsilon and center p\\in X is the set defined by\nS_{\\epsilon}(p)=\\set{x\\in X:d(p,x)\\le \\epsilon}\nIn the case where X is finite, the volume of the (solid) sphere S_{\\epsilon}(p) is its number of elements |S_{\\epsilon}(p)|=\\#S_{\\epsilon}(p).\nThis doesn’t have to be an actual sphere, its just an area where the distance between two vertices is constant."},"Unorganised/Definition-of-an-Alphabet-in-Coding-Theory":{"title":"Definition of an Alphabet in Coding Theory","links":[],"tags":[],"content":"A q-ary alphabet is just a finite set A=\\set{a_{1},a_{2},\\ldots,a_{i}} with q elements, which are called symbols or letters."},"Unorganised/Future-addition-to-the-README":{"title":"Future addition to the README","links":[],"tags":[],"content":"Before starting, you’ll need a GitHub account and Poetry account. For Poetry, you should go to your account settings and click on “Add API token” within the “API tokens” section where you can then name and add a token. Once created, copy the token and add it Poetry’s config with this command:\n \n$ poetry config pypi-token.pypi your-api-token\n "},"Unorganised/Lincoln-Award-Employer-Project-Application":{"title":"Lincoln Award Employer Project Application","links":[],"tags":[],"content":"My interests include chess, where I hold the title of Arena FIDE Master (1623 ELO), programming, and learning languages such as Japanese (casual), French (B1), and German (B1).\nIn terms of work experience, I have collaborated as a Research Team Member at the British Sugar Biofuel Plant, where I identified inefficiencies in biofuel production and honed my public speaking skills. Additionally, I have been a self-employed tutor since October 2020, providing support in Mathematics, Chemistry, and Physics to GCSE and A-Level students, while managing all aspects of my tutoring business.\nI am particularly interested in exploring career opportunities in data analysis or engineering, where I can apply my analytical skills and problem-solving abilities, although I’m still exploring adjacent fields. Participating in one of your projects excites me because it offers a chance to collaborate with like-minded individuals, gain practical experience, and contribute to meaningful solutions in a dynamic environment.\n\nI can bring a range of valuable skills to the project. My experience as a self-employed tutor has equipped me with the ability to convey complex concepts clearly and effectively, ensuring that all team members are aligned. I have a proven ability to work collaboratively, as demonstrated during my time as a Research Team Member at the British Sugar Biofuel Plant, where I contributed positively to diverse team dynamics.\nI am very proficient in the Python programming language, which I have utilised in various projects and coursework. Additionally, my studies in mathematics at the University of Lincoln have provided me with a strong foundation in analytical thinking and quantitative reasoning.\nI also possess a strong customer service orientation, having learned the importance of understanding client needs through my tutoring experience. My interests in programming and language learning reflect my adaptability and willingness to embrace new challenges.\n\nWhile working on the project, I would like to gain actual experience using the skills I have already developed, particularly in teamwork and collaboration. Engaging with a diverse group of individuals will allow me to further hone my ability to work effectively within a team, learning from different perspectives and approaches.\nI also seek to apply my proficiency in Python and mathematics in a practical setting. By tackling real-world problems, I can refine my technical skills and deepen my understanding of how to leverage these tools effectively. This hands-on experience is essential for solidifying my knowledge and preparing me for future career opportunities."},"Unorganised/MTH2002-Coding-Theory---Practical-1":{"title":"MTH2002 Coding Theory - Practical 1","links":["tags/math","tags/mth2002","tags/practical","Unorganised/Definition-of-a-Code-in-Coding-Theory","Unorganised/Definition-of-a-Cartesian-Product-in-Coding-Theory"],"tags":["math","mth2002","practical"],"content":"mathmth2002practical\n\n\nProblem P1\nProve that there are an unlimited number of codes.\nPart A\nWe can recall the definition of a code as follows…\nTransclude of Definition-of-a-Code-in-Coding-Theory\nPart B\nGiven a natural number q\\in N, we can define the following alphabet…\nA_{q} = \\set{0,1,\\ldots,q-1}\\equiv \\mathbb{Z}/q\\mathbb{Z},\\text{or }\\mathbb{F}_{q}\\text{ if }q\\text{ is a prime number.}\nSince there are infinitely many natural numbers, there are infinitely many distinct sets A_{q} that could be a potential alphabet for a code.\nPart C\nWe can recall the definition of a Cartesian product as follows…\nTransclude of Definition-of-a-Cartesian-Product-in-Coding-Theory\nBased on this, we can determine the number of elements of the Cartesian product A_{n} as q\\times q\\times\\ldots\\times q=q^{n}, where q is the number of elements in the set A and n is the number of sets in the Cartesian product. This is because for each of the n positions in the ordered pair, there are q choices, leading to the aforementioned total.\nPart D\nAgain recalling the definition of a code…\nTransclude of Definition-of-a-Code-in-Coding-Theory\nWe can explain that for any value of x\\in N, we can always define at least one code that has at least x elements (codewords), as we can always define an alphabet A with any number q symbols as previously proven.\nProblem P2\nDesigning a code\nEncode single instructions in English, e.g. “skip”, whose length is at most 10. It suffices that it detects and corrects 1 error.\nPart A\nThe alphabet should include all English letters, so…\nA=\\set{a,b,c,d,e,f,\\ldots,x,y,z,\\emptyset}:q=27,n=10\nPart B\nA code could simply repeat each element once per transmission, where it can fill the word to ten characters with empty space \\emptyset. Thus, every message will be n=10 and n=20 when encoded, e.g. skip       → sskkiipp            .\nPart C\nChecking this code, if there is a single error in sskkiipp            , e.g. ssckiipp            , then we can detect where the error is, but not what the correct symbol most be. Hence, we must repeat it three times and whichever symbol shows 2 or more times out of the 3 is the correct symbol:\nskip       → ssskkkiiippp                  .\nThus the final code C can be defined as:\n\nGiven a word with n\\le10 symbols, w=w_{1}w_{2}\\ldots w_{n}, complete w to have 10 symbols be completing it with symbol \\emptyset for empty space, hence w will have 10-n empty space symbols \\emptyset before encoding. After encoding, It’ll have 30-3n empty space symbols and 30 total symbols, as the encoding process repeats each symbols twice, so w_{e}=w_{1}w_{1}w_{1}w_{2}w_{2}w_{2}\\ldots w_{n}w_{n}w_{n}.\n\nProblem P3\nFinding the chance of errors.\nGiven that the error probability p=0.000000001 for transmission, we can calculate the chance of an arbitrary message m being sent without errors, given that |m|=n is the length of the message, as (1-p)^{n}, as an error could happen in each symbol. Hence, the probability of success is 0.999999999^n which is still roughly 0.9999999 after even 100 symbols. This is very high.\nProblem P4\nFinding Hamming distances.\nRecall the set \\mathbb{F}_{q}=\\set{0,1,\\ldots, q-1} when q is prime number.\nPart A\nGiven the word 01010 there are the following words with an exact Hamming distance of two:\n\\begin{align*}\n00000\\\\\n00011\\\\\n00110\\\\\n01001\\\\\n01100\\\\\n01111\\\\\n10010\\\\\n11000\\\\\n11011\\\\\n11110\\\\\n\\end{align*}\nThe total words with a Hamming distance of two, given an alphabet q=2 and word length n=5, are \\binom{5}{2} = \\frac{5!}{2!(5-2)!} = \\frac{5 \\times 4}{2 \\times 1} = 10.\nPart B\nGiven the alphabet \\mathbb{F}_{5}, the Hamming distance between:\n\\begin{align*}\n032314\\\\\n221444\n\\end{align*}\nis 5.\nProblem H1\nISBN-10 is an 11-ary code of length 10 defined as\nC=\\set{(x_{1},x_{2},\\ldots,x_{i})\\in \\mathbb{F}_{11}^{10}:x_{10}=\\sum\\limits_{k=1}^{9}kx_{k},x_{k}\\lt10\\text{ for }k\\le9},\nwhere the symbol 10 is typically denoted by the capital letter X. Note that the last symbol is should equal C \\text{ modulo } 11.\nPart A\n013139\\square399 has a missing digit \\square, which can be recovered by creating an equation based on C that can be solved to find the unknown digit:\n\\begin{align*}\n&amp;0\\cdot0+1\\cdot1+2\\cdot3+3\\cdot3+4\\cdot9+5\\cdot x+6\\cdot3+7\\cdot9+8\\cdot9+9\\cdot9\\\\\n&amp;= 0+1+6+9+36+5x+18+63+72+81\\\\\n&amp;= 286+5x\\\\\n&amp;= 5x \\text{ mod }11\n\\end{align*}\nGiven that this value should equal the last symbol, 5x\\equiv9\\text{ mod }11\\iff x=4.\nA similar process can be used with 0023299\\square00:\n\\begin{align*}\n&amp;0\\cdot0+1\\cdot0+2\\cdot2+3\\cdot3+4\\cdot2+5\\cdot0+6\\cdot0+7\\cdot x+8\\cdot0+9\\cdot0\\\\\n&amp;= 0+0+4+9+8+0+0+7x+0+0\\\\\n&amp;= 21+7x\\\\\n&amp;= 7x-1 \\text{ mod }11\\\\\n\\end{align*}\nThen we can determine that 7x-1\\equiv0\\text{ mod }11\\iff x=8.\nPart B\nAn example of when the last symbol is X could be:\n100000001X\nThis is probably the simplest example."},"Unorganised/Mother-CV":{"title":"Mother CV","links":[],"tags":[],"content":"Victoria Fayers\n\nAddress: censored\nPhone: censored\nEmail: censored\n\n\nI have been fortunate enough to gather a wealth of experience working in an educational setting, as well as a challenging year in an acute hospital setting. I am grateful for praise as an effective, diligent, self-motivated, and cooperative team member. I strive to achieve efficiency and thereby a positive working atmosphere; often seeking to work with my peers to improve the working environment and myself in the process. I am looking forward to continuing my journey to becoming a Speech and Language Therapist and building on the knowledge and experiences I have gained throughout my life and my ongoing education.\n\nExperience\nApril 2021 — July 2021\n1:1 Teaching Assistant, Brookes Cambridge\nAn extremely rewarding position working 1:1 with a non-verbal child with complex needs. Collaborated with SENCo, Class Teacher, Speech and Language Therapist, Physiotherapist, Occupational Therapist, and parents to ensure the child had the best access to education. Instituted the use of Clicker 7 as a communication aide to enable storytelling and independence within lessons.\n\nFebruary 2020 — February 2021\nBand 3 Speech and Language Therapy Assistant, West Suffolk NHS Foundation Trust\nProvided rehabilitation for adults during unprecedented times, focusing on communication therapy for post-stroke and neurological patients. Documented interventions in patient records, liaised with colleagues and families, and performed supportive roles within the community team.\n\nSeptember 2019 — April 2021\nRetail Assistant, Elizabeth Gash Knitwear\nPart-time position covering holiday and sickness. Managed stock control, cash handling, and customer service while maintaining the shop’s reputation.\n\nSeptember 2019 — April 2021\nSupply Teaching Assistant, Reed Education Cambridge\nSupported pupils with severe, profound, and complex learning needs, requiring patience, understanding, and resilience.\n\nDecember 2016 — August 2019\nTeaching Assistant, Howard Community Primary School\nSupported children’s learning and provided behavioral support, working in conjunction with colleagues and outside agencies.\n\nSeptember 2009 — December 2016\nHigher Level Teaching Assistant (HLTA)/Teaching Assistant, St Edmundsbury Ceva Primary School\nProvided educational interventions and speech therapy, teaching various subjects and encouraging healthy eating and positive behavior.\n\nJanuary 2001 — September 2009\nCreche Assistant, Abbeycroft Leisure Centre\nOrganized engaging activities for children under 5, maintaining a positive environment and clear communication with parents.\n\nJanuary 2001 — October 2004 / November 2006 — October 2011\nChildminder, Self-employed, At My Home\nProvided a nurturing educational environment for children, preparing food and organizing activities while ensuring their well-being.\n\nEducation\n2021 - Present\nMSc Speech and Language Therapy, University of Essex\n\n2014 - 2021\nBA (Hons) Childhood and Youth Studies, The Open University - First Class with Honours\n\n2020\nCare Certificate, West Suffolk NHS Foundation Trust\n\nJanuary 2012\nHigher Level Teaching Assistant Status, TDA\n\nMarch 2010\nNVQ3 Children’s Care, Learning and Development, Edexcel\n\nA-levels\n\nEnglish Literature: Grade C\nSocial Biology: Grade E\n\n\nGCSEs\n\nEnglish Literature: Grade B\nEnglish Language: Grade B\nReligious Studies: Grade B\nArt: Grade B\nMaths: Grade C\nBiology: Grade C\nChemistry: Grade C\nPhysics: Grade C\nHistory: Grade C\nFrench: Grade C\n\n\nSkills\n\nPhonics\nBehavioural Intervention\nWorking with Children\nCurriculum Development\nMicrosoft Word\nSpeech Therapy\nPhonetics\nLinguistics\nEarly Childhood/Primary Education\nCustomer Service\nTime Management\nTeamwork\nOrganisational Skills\nKnowledge of Communication Disorders\nKnowledge of Dysphagia\n\n\nActivities\n\nVolunteering: Assisting on school trips, running school-based clubs (crochet, Latin, gardening).\nExercise: Yoga, Pilates, Walking, Swimming.\nHobbies: Crochet, Craft, Sewing, Photography, Gardening, Piano.\nOther Interests: Makaton, Speech therapy.\n"},"Unorganised/My-CV-(draft-one)":{"title":"My CV (draft one)","links":[],"tags":[],"content":"William Fayers\nMotivated undergraduate ready to apply strong communication skills and a passion for helping others to enhance the customer experience.\n\nSecond Year Student\nOpen to Part-Time Opportunities\n\n07578 127943 / william@fayers.com\n\nExperience\nSelf-Employed Tutor (2020 - Present)\n\nProvided tutoring in Mathematics, Chemistry, and Physics to students of various ages, enhancing their understanding and performance in these subjects.\nDeveloped strong customer service skills by effectively communicating with students and parents, addressing concerns, and adapting teaching methods to meet individual needs.\nFostered a supportive learning environment, motivating students to engage with the material and achieve their academic goals.\n\nResearch Team Member, British Sugar Biofuel Plant (2022)\n\nCollaborated with a team of students and professionals to conduct research on an inefficiency during biofuel production.\nEnhanced teamwork and communication skills by presenting findings to staff and participating in group meetings.\n\nVolunteer, Air Cadets (2017 - 2020)\n\nEngaged in various community service projects, developing teamwork and leadership skills while working with peers to achieve common goals.\nAssisted in organising events and activities, enhancing organisational and communication abilities.\n\n\nEducation\nUniversity of Lincoln - Lincoln, England (2023 - present)\nBachelor of Science (Honours) in Mathematics, second year student.\n\nDeveloped organisational and teamwork skills as Secretary of a group project, managing tasks and communications effectively.\n\nAbbeygate Sixth Form College - Bury St Edmunds, England (2021 - 2023)\nA-Levels (AABCC): Extended Project (Level 3), Mathematics, Further Mathematics, Chemistry, and Physics.\n\nHeld leadership roles, including Secretary of the Student Union, where I organised initiatives to improve the student experience and communicated effectively with students and staff, as well as an Ambassador role to represent my college in the community.\n\nCounty High School - Bury St Edmunds, England (2018 - 2021)\nGCSEs (A88888887777): Free-Standing Mathematics Qualification, English Language, six other subjects, Mathematics, three other subjects.\n\nParticipated in a foreign exchange programs, enhancing cultural awareness and language skills.\n\n\nAchievements\n\nAwarded the Arkwright Engineering Scholarship for demonstrating exceptional potential in engineering and technology.\nCompleted the Sutton Trust Program, enhancing my understanding of social mobility and educational equity.\n\n\nSkills\n\nStrong communication and interpersonal skills\nTeamwork and collaboration\nProblem-solving and conflict resolution\nCash handling and customer service\nTime management and organisational skills\nEmpathy and understanding of customer needs\n\n\nInterests\n\nChess: Strategic thinking and problem-solving.\nProgramming: Passion for coding and software development.\nLanguages: Learning Japanese, French, and German.\n"},"Unorganised/My-CV-(re-written)":{"title":"My CV (re-written)","links":[],"tags":[],"content":"William Fayers\nMotivated undergraduate looking to enrich customer experience by communicating well and a bound dedication to serving others.\n\nSecond-Year Student\nOpen to Part-Time Opportunities\n\n07578 127943 / william@fayers.com\n\nExperience\nFreelance Tutor (2020 - Date)\n\nMathematics, Chemistry, and Physics tutoring to students of different age groups, at their comfort and pace, thereby improving comprehension and grades.\nDemonstrated utmost customer service: effectively communicated with students and parents, listened to their concerns, and accommodated individual learning needs. Built a helpful learning environment which would interest the student toward learning and achieving their academic goals.\n\nResearch Team Member, British Sugar Biofuel Plant (2022)\nCollaborate with students and professionals to identify inefficiencies in biofuel production.\nDeveloped teamwork and communication skills: presented findings and participated in active meetings.\nVolunteer, Air Cadets * (2017 - 2020) *\n\nParticipated in community service events and projects with other cadets; enhancing teamwork and leadership skills by working as a team.\nOrganized and ran activities and events; developing organizational and communication skills.\n\n\nEducation\nUniversity of Lincoln - Lincoln, England * (2023 - present) *\nBachelor of Science (Honours) in Mathematics, second year student.\n\nDeveloped organizational and teamwork skills as Secretary of a group project, overseeing tasks and communications.\n\nAbbeygate Sixth Form College, Bury St Edmunds, England emezPower (2021 - 2023)\nA-Levels (AABCC): Extended Project (Level 3), Mathematics, Further Mathematics, Chemistry, and Physics.\nLeading as the Secretary of Student Union organizing initiatives in making the experience for students better and fostering the communication between students and staff, while also representing my college as an Ambassador in the community.\nCounty High School, Bury St Edmunds, England emezPower *(2018 - 2021)\nGCSEs: (A88888887777) Free-Standing Mathematics Qualification, English Language, six other subjects, Mathematics, three other subjects.\nUndertook the foreign exchange program to help with cultural awareness and language abilities of other nations.\n\nAchievements\n\nAwarded the Arkwright Engineering Scholarship due to outstanding potential within engineering and technology.\n\n\nSkills\n\nExcellent communication and interpersonal skills\nTeam collaboration\nProblem-solving and conflict resolution\nCash handling and customer service\nTime management and organization\nEmpathy for the customer’s needs\n\n\nInterests\n\nChess: The strategic thinking, solving.\nProgramming: Because I love coding and developing software.\nLanguages: Learning Japanese, French, and German.\n"},"Unorganised/Random-Notes---Algebraic-Structures":{"title":"Random Notes - Algebraic Structures","links":["abelian-group","Auto-Generated/AI-Chats/Chat-2024_09_23-16_30_07"],"tags":[],"content":"An algebraic structure is something with a set, operation, and identities or axioms. They help us understand what different mathematical objects have in common and allow us to understand things more abstractly. Essentially, it’s just another level of generalisation beyond simple variables.\n\n\n                  \n                  Note on notation \n                  \n                \n\nOften a generic operation is given as a*b, but can also be written as ab, a\\cdot b, as well as essentially any other symbol. Thus it should be clearly defined to avoid confusion.\n\n\nGroups\n\n\n                  \n                  Definition \n                  \n                \n\nA group is a set G together with an operation * such that all of four of the following axioms hold:\n\nClosure: If x,y\\in G, then x*y is also in G.\nAssociativity: If x,y\\in G, then x*(y*z)=(x*y)*z.\nExistence of an Identity Element: We can find an element e\\in G satisfying e*x=x*e=x, for all x\\in G .\nExistence of inverse elements: If x\\in G, we can find y\\in G such that x*y=y*x=e.\n\n\n\nIf a set withholds these four axioms, then that set is the type of algebraic structure called a group. Some of these groups follow an additional axiom which makes it an abelian group (commutativity, i.e. the order of operations does not affect the result). Often it is easy to disprove that a set is a group with a counter-example, but proving a set is a group is involves a rigorous proof of each axiom.\n\n\n                  \n                  An informal example \n                  \n                \n\nThe integers \\mathbb{Z}. If we take two integers x and y in \\mathbb{Z}, x+y is also in \\mathbb{Z} (\\mathbb{Z} is closed). If you add three integers together, whether you initially sum the first two or the last two, it doesn’t affect the result (\\mathbb{Z} is associative). Adding 0 to any integer doesn’t affect the result (\\mathbb{Z} has the identity element 0). For each integer, there is another integer which brings the first integer back to zero, i.e. for every x in \\mathbb{Z}, there is -x (every element in \\mathbb{Z} has an inverse).\n\n\nNote that groups aren’t all this clearly algebraic, there are also a lot of geometric groups, such as the transformations of a square D_{8}.\nChat-2024_09_23-16_30_07\n"},"Unorganised/Random-Notes---Coding-Theory-1":{"title":"Random Notes - Coding Theory 1","links":["tags/todo","tags/math","tags/mth2002","tags/lecturenotes","Unorganised/MTH2002-Coding-Theory---Practical-1","generating-QR-Codes","Reed-Solomon-Error-Correction","modular-arithmetic","Hamming-codes"],"tags":["todo","math","mth2002","lecturenotes"],"content":"todomathmth2002lecturenotes\n\n\n                  \n                  QUOTE\n                  \n                \n\nIf you state some information, you must either rigorously prove the claim or reference where someone else does so. - Yuri\n\n\nMTH2002 Coding Theory - Practical 1\nWhat is Coding Theory?\nBasically just the study of encoding and decoding information, where the process between is a transformation, such as the transformation between languages or to encode files, e.g. .mp3 files.\n\n\n                  \n                  Mathematical Definition \n                  \n                \n\nLet A be a finite set with q elements, A=\\set{a_{1}, a_{2}, \\ldots, a_{q}}.\nLet us call the elements of A symbols and A will be called an alphabet.\nA message (or data, or information), over the alphabet A, is just a finite sequence of symbols out of A. Traditionally, a message consisting of n symbols is called a word (or vector or string) of length n.\nFor example, a word a_{4}a_{1}a_{3}a_{2} would have length n=4.\n\n\n\nBuilding Blocks of a Code\n\n\n                  \n                  EXAMPLE\n                  \n                \n\nThe modern latin alphabet \\set{A,B,\\ldots,Y,Z}, the Greek alphabet \\set{\\alpha, \\beta, \\gamma,\\ldots, \\zeta}, Egyptian hieroglyphs, decimal digits, and even the set of pheromones of ants are alphabets (as these are the chemical signals they use for communication).\n\n\nEssentially, any set of symbols that are used for communication can be labelled an alphabet. Any combination of these symbols is called a word, where one or more of these is then a set of messages over A (the alphabet set).\n\nEncoding Process\nLet X and A be alphabets, and let C be some set of messages over A. An encoding-decoding rule (or process) for X with target C is just a transformation\nf:\\set{\\text{some set of messages over }X}\\to C\nthat can be reversed. Here, X is called the original alphabet, and C (the target set) has elements named codewords (or coded messages, or coded words). A is just the alphabet for C, as previously defined.\n\n\n                  \n                  EXAMPLE\n                  \n                \n\nThe original alphabet is thus X=\\set{N,S,E,W}, the set of messages is again just \\set{N,S,E,W}, the alphabet of the code will be the binary set A=\\set{0,1}, the code is C_{1}:=\\set{00,11,01,10}, and the encoding-decoding function is the function f:\\set{N,S,E,W}\\to C_{1}, where each element maps to an element of C_{1}, e.g. N\\to00.\n\n\n\nAssumptions during encoding\nAssumption one\nFor practical purposes, it is common for data (words, messages, information) to be transmitted in blocks through a rigid transmission scheme, i.e the transmission channel and means are not changing during transmission. Essentially, we assume that once an alphabet A is set, transmissions usually send a messaged of a fixed length n.\n\nAssumption two\nAnother natural assumption is that as few errors as possible have occurred, otherwise the problem likely lies in transmission channels, not with the code itself. In particular, if we received a sequence of symbols that is not a valid word, we will look for a valid codeword that looks as much as possible like the word received. At lot like choosing the closest multiple-choice answer to the result you got on a test.\n\n\n                  \n                  EXAMPLE\n                  \n                \n\nSuppose our code is the set \\set{0000,1111,1110,0110} and that in two transmissions we receive the words 0001 and 0111.\nIn the first transmission, it is more likely that the intended first word to be received was 0000.\nIn the second transmission, it could have been 1111 or 0110. However, extending the error correction from the first word, we can assume the error is within the last digit again, so the second word would be logically assumed to be 0110.\n\n\n\nAssumption three\nWe suppose that each symbol being transmitted has the same probability p&lt; \\frac{1}{2} of being received in error. We call the number p the symbol error probability of the channel. This is essentially an assumption that most of the symbols are transmitted successfully, as mentioned in assumption two.\nIf a symbol in a given position is received in error, each of the remaining q-1 (where q is the length of the alphabet A) symbols is equally likely: \\frac{p}{q-1} is the probability that a particular symbol appears in a given position instead of the correct one. This formula isn’t often used, but is useful for general knowledge about coding theory.\n\n\n                  \n                  EXAMPLE\n                  \n                \n\nConsider the code C_{1}:=\\set{00,11,01,10}. Suppose the channel has symbol probability p=0.01 and that a word has been transmitted.\nThe chance that the word is received with no errors is equal to the probability that no errors occur in the first digit and that no errors occur in the second digit. Thus this probability is (1-p)^{2}=0.99^{2}=0.9801, a very high chance.\n\n\n\nWhy do we study Coding Theory?\n\nDo we want to have a fast transmission channel? (studied within Data Compression, trying to shrink data as much as possible, sometimes adjusting the transmission channel).\nDo we want to exchange information secretly? (studied within Cryptography, transforming data so that only the receiver understands, thus focuses on the encoding-decoding process)\nDo we want to transmit efficient and accurate data? (studied within Coding Theory)\n\nCoding Theory is the subarea of information theory that studies codes that detect errors and/or correct errors. Thus, this discipline provides codes designed in such a way that if errors occur in transmission, then the receiver can detect and/or correct errors based on the remaining symbols received and so recover the intended codeword.\n\n\n                  \n                  NOTE\n                  \n                \n\nI studied this when generating QR Codes, when I implement Reed-Solomon Error Correction, as well as when I studied error correction algorithms using parity.\n\n\nHow do we formalise Coding Theory?\nGiven an alphabet A with q symbols, a q-ary code (over A) of length n is a subset C\\subset A^{n}. That is, C is some set of words length n taken from an alphabet A consisting of q symbols. A (valid) codeword is an element of C.\nWe say that C detects t errors if, whenever up to t errors occur in the transmission of any codeword, then one can recognise this from the code C. Similarly, we can correct k errors. For example, C_{1} mentioned in numerous example within this note does not detect or correct any errors. On the contrary, we can design a code to do just that:\nThe simplest error correction, parity checking\nA useful and relevant video.\nC_{2}:=\\begin{cases}\n0 &amp; 0 &amp; 0 &amp; \\leftrightarrow &amp; N \\\\\n1 &amp; 1 &amp; 0 &amp; \\leftrightarrow &amp; S \\\\\n0 &amp; 1 &amp; 1 &amp; \\leftrightarrow &amp; E \\\\\n1 &amp; 0 &amp; 1 &amp; \\leftrightarrow &amp; W\n\\end{cases}\nThis is C_{1}, with an addition digit sent representing the parity of the other two digits (the sum of the first two under the additive rule 1+1=0 for the binary set \\set{0,1} - modular arithmetic).\nHence, if the parity does not line up across the digits, then we have detected an error. This falls apart if any of our three assumptions made during explaining encoding are not correct, such as both digits being transmitted incorrectly, but under our assumption this error correction is perfect, despite its simplicity.\nThis code also does not correct any errors, as we don’t know where the error occurred, only simply that one did occur. This is fixed with Hamming codes, where you implement an additional parity digit which counts the parity of the entire matrix. The video linked at the beginning of this section explains this very well: watch it! The are numerous other ways of fixing this flaw, both more efficient and less efficient.\nMany error correction algorithms simply extend this logic, like with Reed-Solomon instead checking the behaviour of a polynomial generated from the co-efficients of the data matrix.\nISBN Example\n…\nHamming Distance\nComputes the number of positions across two words where their symbols are different, e.g. 010010 and 011000 has d(w_{1},w_{2})=2 as two symbols are different in the same positions, given that A=\\set{0,1} (q=2) and n=6.\nThus, it’s a useful measure of how many errors might have occurred in transmission, and can be used as a measurement to minimise error. This is known as the nearest neighbour decoding strategy.\nHamming’s Original code\nC is the subset of \\mathbb{F}_{2}^{7} consisting of all elements (c_{1},c_{2},\\ldots,c_{7}) satisfying c_{5}=c_{1}+c_{2}+c_{4}, c_{6}=c_{1}+c_{3}+c_{4}, and c_{7}=c_{2}+c_{3}+c_{4}. Thus the first four digits are known as the source word and the last three as parity bits.\nGiven a codeword w, we could receive codeword u with some possible errors. Usually, it can correct odd errors, but if there are an even number of errors that it isn’t always corrected.\nNEXT TIME:\nDistance theorem, chances of detection/correction, parameters of codes, main problem."},"Unorganised/Random-Notes---Coding-Theory-2":{"title":"Random Notes - Coding Theory 2","links":["Unorganised/Definition-of-an-Alphabet-in-Coding-Theory","Unorganised/Definition-of-a-Code-in-Coding-Theory","Unorganised/Definition-of-Hamming-Distance","Unorganised/Definition-of-Metric-Spaces-and-Distance-Functions","Unorganised/Definition-of-Minimum-Code-Distance","Unorganised/Definition-of-Error-Detection","Unorganised/Definition-of-Error-Correction","Unorganised/Definition-of-Distance-Theorem","Unorganised/Definition-of-a-Solid-Sphere","Unorganised/Definition-of-Nearest-Neighbour-Decoding"],"tags":[],"content":"Recap\nTransclude of Definition-of-an-Alphabet-in-Coding-Theory\nTransclude of Definition-of-a-Code-in-Coding-Theory\nTransclude of Definition-of-Hamming-Distance\nDoes Hamming distance have geometry?\nHow do we define something having geometry?\nTransclude of Definition-of-Metric-Spaces-and-Distance-Functions\nExamples\nThere are some familiar examples of these metric spaces, as we often measure distance:\n\n\n                  \n                  Euclidean distance \n                  \n                \n\nFrom linear algebra and calculus, on n-dimensional real vector space \\mathbb{R}^{n} , the standard Euclidean distance is a metric, turning \\mathbb{R}^{n} into a metric space:\nd((x_{1},x_{2},\\ldots,x_{i}),(y_{1},y_{2},\\ldots,y_{i}))=\\sqrt{(x_{1}-y_{1})^{2}+\\ldots+(x_{n}-y_{n})^{2}}\nI.e. measuring distance in a 2d plane using the Pythagorean Theorem, which can be generalised to n-dimensions.\n\n\n\n\n                  \n                  Spherical distance \n                  \n                \n\nLike on an approximated Earth, a round sphere \\mathbb{S}^{2} is a metric space using the great circle distance. That is, given two points on the sphere’s surface, draw a great circle passing through both - their distance is measured as the length of the shortest (sub)arc so drawn between them.\nExplicitly, given the radius of the sphere r and thatP and Q are coordinates in longitude-latitude coordinate form (\\lambda,\\phi) and (\\mu,\\rho) respectively: d(P,Q)=r\\cdot \\cos(\\sin(\\phi) \\sin(\\rho) + \\cos(\\phi)(\\cos(\\rho) \\cos(|\\lambda − \\mu|)))\n\n\nAnother example is the discrete metric, where you simply take any set S and define:\nd(x,y)=\\begin{cases}\n1, &amp; \\text{if }x\\ne y, \\\\\n0 &amp; \\text{otherwise.}\n\\end{cases}\nThis is very hard to visualise, though.\nIs Hamming distance a metric?\nLet A be a q-ary alphabet. Then the Hamming distance on the set A^{n} of words of length n over A is a metric. This can be proven using skills from the Proof module last year, defining necessary variables and then directly proving each axiom in the Definition of Metric Spaces and Distance Functions. From this proof, we can also correlate that words over an alphabet build metric spaces, as do codes.\nWhy is this useful?\nHaving A^{n} and codes C\\subset A^{n} as metric spaces means we can take advantage of geometric concepts, such as geodesics: the shortest path between any two points.\nThe Hamming distance on an alphabet and a code from it represents the shortest path between any given pair of words. Logically, this makes sense: the Hamming distance represents the smallest number of changes to correct one word to its original. This can be mathematically proven, too, using induction.\nGiven that it’s a metric space, we can also draw these spaces as (metric) graphs, like we did in the Algebra module, e.g. \\mathbb{F}_{2}^{3} is a cube where each edge represent a Hamming distance of 1 and each vertex is a possible codeword. The minimum distance along these graphs (shortest path) is the Hamming distance, again.\nTransclude of Definition-of-Minimum-Code-Distance\nCan this relate to error detection and correction?\nTransclude of Definition-of-Error-Detection\nTransclude of Definition-of-Error-Correction\nThe main theorem that relates these ideas with geometry, is the Distance Theorem:\nTransclude of Definition-of-Distance-Theorem\nHow do we prove the Distance Theorem?\nTo prove this theorem, we need to define a solid sphere:\nTransclude of Definition-of-a-Solid-Sphere\nThen, you can prove the first half of the theorem by proving t\\lt d_{\\text{min}}(C) (as the theorem then follows from this), where t represents the number of detected errors. The proof then assumes this, and proves (given that d_{\\text{min}}(C) is the smallest possible distance between valid codewords of C) that a received word w is in the solid sphere of radius t is less than d_{\\text{min}}(C) by construction.\nTo prove error correction, we require a lemma based on two geometric observations:\n\nTwo solid spheres of radius k (where k errors are corrected) around any pair codewords do not contain any valid codewords in common,\nA word within a solid sphere for any given codeword, you require a larger solid sphere to jump to another valid codeword.\nThese are quite logical, but can be written mathematically and hence proven, too. The first is proven by assuming the false claim and then contradicting itself, and the second by directly proof (re-writing the lemma as an inequality and simplifying it with the triangle inequality).\n\nThen, we can prove this half of the theorem by proving that, if d_{\\text{min}}(C)\\ge 2k+1, then C corrects k errors. We then take the aforementioned lemmas, the general principle (that we assume a few errors as possible occurred during transmission), and corollary about geodesics mentioned before, to directly prove the statement.\nWhat’s the main strategy used to prove the Distance Theorem?\nThe strategy is so useful, it’s named:\nTransclude of Definition-of-Nearest-Neighbour-Decoding\nDoes this theorem tell us anything else?\nThe distance theorem then also correlates how many errors a code C can detect (d-1 errors) and correct (up to \\lfloor\\frac{d-1}{2}\\rfloor), where \\lfloor\\rfloor is the floor function and d=d_{\\text{min}}(C).\nFor example, a code C=\\set{0000,1111,2222} (a repetition code of length 4 over F_{3}=\\set{0,1,2}) has d_{\\text{min}}(C)=4, so C can detect up to 4-1=3 errors and correct \\lfloor \\frac{4-1}{2}\\rfloor=\\lfloor \\frac{3}{2}\\rfloor=\\lfloor1.5\\rfloor=1 error.\nA repetition code of length 5 over an alphabet length 2 can then detect 4 errors and correct 2 errors.\nThis can be logically worked out, by thinking about how the code could work, but these formulae are very useful for more complex codes. Sometimes, more errors can be detected and correct, but in general this is not the case (and can be generally proven: the distance theorem is optimal)."},"Unorganised/Random-Notes---Differential-Equations":{"title":"Random Notes - Differential Equations","links":[],"tags":[],"content":"What is a Differential Equation?\nAn equation containing the derivatives of one or more unknown functions (or dependent variables), with respect to one more independent variables, is a differential equation (DE).\n\nWhy are Differential Equations important?\nThey often represent physical quantities and their rate of change, giving us a relationship to predict physical events.\n\nWhat terminology is used?\nDifferential Equations: Equations involving derivatives that describe how one quantity changes relative to another.\nOrder: The highest derivative present; e.g., a second derivative indicates a second-order equation.\nTypes:\n\nOrdinary Differential Equations (ODEs): Involve functions of a single variable and their derivatives.\nPartial Differential Equations (PDEs): Involve functions of multiple variables and their partial derivatives.\n\nForms:\n\nNormal Form: A standard, simplified expression of a differential equation.\nDifferential Form: Representation in terms of derivatives.\n\nLinearity:\n\nLinear Differential Equations: The dependent variable and its derivatives appear to the first power and are not multiplied together.\nNon-Linear Differential Equations: The dependent variable or its derivatives appear in powers greater than one or are multiplied together.\n\n\nHow do we use this terminology to classify Differential Equations?\n\nType: is it an ordinary or partial differential equation?\nOrder: what is the highest order derivative?\nLinearity: is it linear or non-linear?\n\n\nHow do we verify solutions to Differential Equations?\nSubstitute the solution into the differential equation, differentiating it where required.\n\n\n                  \n                  EXAMPLE\n                  \n                \n\nVerify whether y= \\frac{6}{5}- \\frac{6}{5}e^{-20t} is a solution to the differential equation \\frac{dy}{dt}+20y=24.\n\n\nThe solution to this example is like so:\n\\begin{align*}\n\\frac{dy}{dt}+20y=24:y= \\frac{6}{5}- \\frac{6}{5}e^{-20t}, \\frac{dy}{dt}=24e^{-20t}&amp;\\implies&amp;24e^{-20t}+24-24e^{-20t}=24\\\\\n&amp;\\implies&amp;\\text{LHS}=24,\\text{RHS}=24\\\\\n&amp;\\therefore&amp;\\text{Valid solution}\n\\end{align*}\nThe differential equation in question is an ordinary first order linear differential equation."},"Unorganised/Random-Notes---Lagrangian-and-Hamiltonian-Mechanics":{"title":"Random Notes - Lagrangian and Hamiltonian Mechanics","links":[],"tags":[],"content":"Landau &amp; Lifshitz, Mechanics, pages 1-3 and 96.\nKibble &amp; Berkshire, Classical Mechanics, 5th edition, page 231.\nThe module is mostly just heavy mathematics applied to mechanics.\n\nRecap of Derivatives\nNotation for a full derivative involving x…\ny(x)=x^{2}\\implies \\frac{dy}{dx}=y^{\\prime}=2x\nNotation for a full derivative involving t…\ny(t)=t^{3}\\implies \\frac{dy}{dt}=\\dot{y}=3t^{2}\nTypes of derivative…\n\\frac{d}{d(...)}:\\text{full derivative}\nor…\n\\frac{\\partial}{\\partial(...)}:\\text{partial derivative}\nWhen differentiating a variable, the other variable(s) are treated as constant:\n\\begin{align*}\nf(x,y)=x^{2}y\\implies &amp;\\frac{\\partial f}{\\partial x}=2xy,\\\\\n&amp;\\frac{\\partial f}{\\partial y}=x^{2}\n\\end{align*}\nIn terms of t…\n\\begin{align*}\nf(x,t)=xt\\implies&amp;\\frac{\\partial f}{\\partial x}=t,\\\\\n&amp;\\frac{\\partial f}{\\partial t}=x\n\\end{align*}\nBut what would be the total derivative of f(x,t) with respect to t? Keep in mind that whilst x is a variable, it can be expressed in terms of t (and hence as a function x=x(t)). Total derivative = rate of change if all variables can change.\n\\frac{df}{dt}\\equiv\\frac{\\partial f}{\\partial t}+\\frac{\\partial f}{\\partial x}\\cdot\\frac{\\partial x}{\\partial t}\nThis equivalence is essentially made up of partial derivatives treating each thing as a variable whilst keeping another constant, but ensuring the result still stays in the form \\frac{(...)f}{(...)t}. It’s like you’re adding all the changes up for every variable in order to calculate how much change the entire function has, with respect to a single variable.\n\\begin{align*}\n\\frac{df}{dt}&amp;=\\frac{\\partial f}{\\partial t}+\\frac{\\partial f}{\\partial x}\\cdot\\dot{x}\\\\\n&amp;=x+t\\dot{x}\n\\end{align*}\nNote: How do we tell the difference between partial and total derivatives when the notation is in the form \\dot{x}?\nf(x,y,t)\\implies \\frac{df}{dt}=\\frac{\\partial f}{\\partial t}+\\frac{\\partial f}{\\partial x}\\cdot\\frac{\\partial x}{\\partial t}+\\frac{\\partial f}{\\partial y}\\cdot\\frac{\\partial y}{\\partial t}\nThis pattern for a full derivatives extends continually for additional variables. Note: What other notation is there in different languages, like French?\n\\begin{align*}\nf(x,\\dot{x})=x\\cdot\\dot{x}^{2}\\implies&amp;\\frac{\\partial f}{\\partial x}=\\dot{x}^{2}\\cdot\\frac{\\partial x}{\\partial x}=\\dot{x}^{2}\\\\\n&amp;\\frac{\\partial f}{\\partial \\dot{x}}=x \\frac{\\partial(\\dot{x}^{2})}{\\partial x}=x\\cdot2\\dot{x}\n\\end{align*}\n\\begin{align*}\nf(x,\\dot{x})=x\\cdot\\dot{x}\\implies \\frac{df}{dt}&amp;=\\frac{\\partial f}{\\partial x}\\cdot\\frac{\\partial x}{\\partial t}+\\frac{\\partial f}{\\partial \\dot{x}}\\cdot\\frac{\\partial \\dot{x}}{\\partial t}\\\\\n&amp;=\\dot{x}\\cdot\\dot{x}+x\\cdot\\ddot{x}\\\\\n&amp;=\\dot{x}^{2}+x\\cdot\\ddot{x}\n\\end{align*}\n(the first term with respect to t is omitted, since it’s equal to 0)\nNote: figure out a better way to type partial derivatives in LaTeX - it’s so annoying\n\nRecap of Newton Mechanics\nEnergy E=T+U: the sum of the kinetic and potential energy, respectfully.\nKinetic Energy (scalar and vector)…\nfor a particle of mass m: T=\\frac{mv^{2}}{2}\nfor two particles of masses m_{1},m_{2}: T=T_{1}+T_{2}=\\frac{m_{1}v_{1}^{2}}{2}+\\frac{m_{2}v_{2}^{2}}{2}\nfor a particle of mass m moving along x (where everything is moving →, including a unit vector \\hat{i}:|\\hat{i}|=1): \\vec{v}\\equiv \\dot{x}\\hat{i}, T=\\frac{m\\dot{x}^{2}|\\hat{i}|^{2}}{2}=\\frac{m\\dot{x}^{2}}{2}.\nfor two particles of masses m_{1},m_{2} moving along x (where everything is moving →, including a unit vector \\hat{i}:|\\hat{i}|=1): T=T_{1}+T_{2}=\\frac{m_{1}\\dot{x_{1}}^{2}}{2}+\\frac{m_{2}\\dot{x}_{2}^{2}}{2}.\nPotential Energy (gravity and spring)…\nfor a mass m a distance h from the Earth’s surface: U=mgh:g \\text{ is a constant}.\nfor masses m_{1},m_{2} distances h_{1},h_{2} from the Earth’s surface: U=U_{1}+U_{2}=m_{1}gh_{1}+m_{2}gh_{2}.\nfor a spring compressed with a change in length \\Delta{x}: U=\\frac{1}{2}k(\\Delta x)^{2},\\text{ where }k \\text{ is a constant}, or if \\Delta x is not given, then it can be calculated by calculating the original length of the spring and subtracting its final length ((x_{2}-x_{1})-l): U=\\frac{1}{2}k(x_{2}-x_{1}-l)^{2}.\n\nGeneralised co-ordinates and degrees of freedom.\nBy definition, if co-ordinates completely define a position then they are generalised co-ordinates.\nOften denoted by q_{i}, where i is the index.\nEqual to the number N of degrees of freedom, \\text{d.f.}\nFor a particle in one-dimension, there is one degree of freedom (1\\text{d.f.}) since it can only move along one axis, x, hence 1\\text{g.c.}\nFor a particle in two-dimensions (on a plane), there are two degrees of freedom (1\\text{d.f.}) since it can move along two axes, x and y, hence 2\\text{g.c.}.\nNote: the generalised co-ordinates here are x and y, but they’re also often denoted simply as q_{1} and q_{2}. This allows for higher dimensions than x,y,z allows - again, this is hinting towards the mathematical nature of this module.\nFor a particle in three-dimensions (in a volume)… you get the idea. Three degrees of freedom (3\\text{d.f.}) along q_{1},q_{2},q_{3}.\nThese co-ordinates do not need to be Cartesian, for example they could be polar co-ordinates:\nin two dimensions, (r,\\theta) have 2\\text{d.f.} and hence 2\\text{g.c.}:q_{1},q_{2}.\nin three dimensions (spherical co-ordinates), (r,\\theta,\\phi) have 3\\text{d.f.} and hence 3\\text{g.c.}:q_{1},q_{2},q_{3}. insert funny haha about modelling the physics of spherical horses\nThese definitions hold for all co-ordinate systems, for N dimensions, where the co-ordinate system will have (N) \\text{d.f.} and (N) \\text{g.c.} with q_{1},q_{2},\\ldots,q_{i}. Note that this is for a single particle - for n particles, the system would have (nN) \\text{d.f.}.\n\nConstraints - particle limitations on position or velocity.\nHolonomic constraints - can be expressed by the equation f(q_{1},\\ldots,q_{s},t)=0, i.e. a function dependent on generalised co-ordinates and time which is equal to zero.\nIf constraints can not be expressed in this way, they are non-holonomic.\nNote that we focus on holonomic, I assume because of the complexity increase when solving differential equations that are equal to a non-zero function.\nFor example…\na one-dimensional rod stretching between x_{1} and x_{2} (hence with length l=x_{2}-x_{1}) can be expressed as x_{2}-x_{1}-l=0 and thus as f(x_{1},x_{2})=0. Therefore we can conclude the constraint is holonomic.\nAnother example…\na two-dimensional rod stretching between (x_{1},y_{1}) and (x_{2},y_{2}) (hence with length l^{2}=(x_{2}-x_{1})^{2}+(y_{2}-y_{1})^{2}) can be expressed as (x_{2}-x_{1})^{2}+(y_{2}-y_{1})^{2}-l^{2}=0 and thus as f(x_{1},x_{2},y_{1},y_{2})=0. Therefore we can again conclude the constraint is holonomic.\nNote: the absence of time is okay, it’s simply equal to 0.\nN particles with p holonomic constraints has degrees of freedom (\\text{d.f.}):\none-dimension: n=N-p\ntwo-dimensions: n=2N-p\nthree-dimensions: n=3N-p\netc.\nThis makes sense extending the logic before, as each constraint restricts the movement of a particle by one “axis”. Remember, the degrees of freedom is just a numerical value of how much the particles can move in a system."},"Unorganised/Unorganised":{"title":"Unorganised","links":["tags/"],"tags":["index"],"content":"index\nid: 5d01fe4a-0505-4c8d-b4cb-fb3fb4cc5031\nfolderPath: &quot;&quot;\ntitle: &quot;{{folderName}} overview&quot;\nshowTitle: false\ndepth: 10\nincludeTypes:\n  - folder\n  - markdown\nstyle: list\ndisableFileTag: false\nsortBy: name\nsortByAsc: true\nshowEmptyFolders: true\nonlyIncludeSubfolders: false\nstoreFolderCondition: true\nshowFolderNotes: true\ndisableCollapseIcon: true"},"Unorganised/Video-Length-Conversion-Challenge":{"title":"Video Length Conversion Challenge","links":["tags/"],"tags":[""],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Video Length in SecondsYou are given the length of a video in minutes. The format is mm:ss (ex: &quot;02:54&quot;).Create a function that takes the video length and return it in seconds. Examples&lt;br&gt;minutesToSeconds(&quot;01:00&quot;) = 60&lt;br&gt;&lt;br&gt;minutesToSeconds(&quot;13:56&quot;) = 836&lt;br&gt;&lt;br&gt;minutesToSeconds(&quot;10:60&quot;) = -1&lt;br&gt;&lt;br&gt;minuteToSeconds(&quot;121:49&quot;) = 7309&lt;br&gt; Notes- The video length is given as a string.    - If the number of seconds is 60 or over, return -1 (see example #3).    - You may get a number of minutes over 99 (e.g. &quot;121:49&quot; is perfectly valid)."},"Unorganised/William-Fayers":{"title":"William Fayers","links":[],"tags":[],"content":"Dedicated and flexible undergraduate student seeking part-time work to support my studies.\n\nSecond-Year Student\nOpen to Part-Time Opportunities\n\n07578 127943 / william@fayers.com\nExperience\nResearch Team Member, British Sugar Biofuel Plant (Feb 2022 - Dec 2022)\n\nCollaborated with students and professionals to identify inefficiencies in biofuel production, developing the ability to work within a team successfully.\nApplied and developed public speaking skills when presenting findings to staff and actively participating in meetings.\n\nSelf-Employed Tutor (Oct 2020 - present)\n\nTutored Mathematics, Chemistry, and Physics to GCSE and A-Level students, carefully listening to their needs to foster a supportive learning environment.\nEffectively communicated with students and parents to address weaker points in the student’s education.\nManaged all marketing and finances, including invoicing, advertising, and cash handling, in addition to delivery of tuition.\n\nVolunteer, Air Cadets (Sept 2017 - Feb 2020)\n\nParticipated in community service events and projects with other cadets, positively interacting with the community and supporting other volunteers with their responsibilities.\nWorked within my squadron to deliver on the tasks given, communicating within the team and using initiative to complete essential tasks proactively.\n\nEducation\nUniversity of Lincoln - Lincoln, England (2023 - present)\nBachelor of Science (Honours) in Mathematics, second-year student: on track for First Class (97% average).\n\nApplied organisational and teamwork skills collaborating on a group project, communicating effectively with other group members.\n\nAbbeygate Sixth Form College - Bury St Edmunds, England (2021 - 2023)\nA-Levels: Level 3 Extended Project (A), Mathematics (A), Further Mathematics (B), Chemistry (C), and Physics (C).\n\nHeld multiple leadership roles, including Secretary of the Student Union managing communication between students and staff and organising the Union, as well as an Ambassador role to represent my college during open days and within the community.\n\nCounty High School - Bury St Edmunds, England (2018 - 2021)\nGCSEs: Free-Standing Mathematics Qualification (A), English Language (8), six other subjects (8), Mathematics (7), three other subjects (7).\n\nParticipated in foreign exchange programs to explore new cultures and practise adapting to new situations.\n\nAchievements\n\nAwarded the Arkwright Engineering Scholarship for demonstrating exceptional potential in engineering and technology.\n\nSkills\n\nStrong communication and interpersonal skills.\nProven teamwork and collaboration.\nProblem-solving and conflict resolution.\nPraised in word of mouth referrals for excellent customer service.\nDemonstrated time management and self-motivation supporting academic progress.\n\nInterests\n\nChess: Arena FIDE Master (1623 ELO) regularly competing to practise strategic thinking.\nProgramming: Enthusiasm for coding and software development.\nLanguages: Learning Japanese (casual), French (B1), and German (B1).\n"},"Unorganised/application-supporting-statements":{"title":"application supporting statements","links":[],"tags":[],"content":"What makes you a good fit for the role of Student Ambassador? Feel free to include relevant life experiences, work (both paid and unpaid), education, training, hobbies, and personal interests. (Max 250 words)\n…\nCould you share an example from your volunteer or work experience where you had to swiftly adapt to a challenging situation? (Max 250 words)\n…\nPlease share an example of a time when you successfully worked as part of a team to achieve a common goal. What was the team’s accomplishment, and what role did you play in it? (Max 250 words)\n…"},"index":{"title":"index","links":["tags/","tags/todo"],"tags":["index","todo"],"content":"indextodo\n\n\n                  \n                  Work in progress!! \n                  \n                \n\nthis is a test."}}